[
{"title": "CHOURANGI BUILDERS AND DEVELOPERS PVT. LTD. v. HANSA KISHORE SHAH AND OTHERS", "date": null, "summary": "SAST/92146/2020 remanded For the Appellant: in SAST921582020 and SAST921862020 and For the Respondent: No.3 in SAST92146 of 2020.   Mr. Mayur Khandeparkar aw Mr. Ranjeev Carvalho, Mr. Vikramjit Garewal, Ms. Sabeena Mahadik, Mr. Pankaj Uttaradhi and Mr. Aayush Kothari For the Respondent: No.3 in SAST92158 and SAST921862020 and For the Appellant: in SAST921462020. Mr. Ramesh Tripathi, For the Respondent: Nos. 1 and 2 in SAST921462020 and For the Respondent: No.2 in SAST921862020 HON'BLE SHRI JUSTICE S.C. GUPTE \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t sub-section (5) of Section 43 Maharashtra Regional and Town Planning Act, 1966  Chittewan 1/7 10&11&12(stm). SA(St) No.92158 of 2020 +2.doc  IN THE HIGH COURT OF JUDICATURE AT BOMBAY  CIVIL APPELLATE JURISDICTION  SECOND APPEAL (St.) NO.92158 OF 2020  ALONG WITH  INTERIM APPLICATION NO.92694 OF 2020  AND  SECOND APPEAL (St.) NO.92186 OF 2020  ALONG WITH  INTERIM APPLICATION NO.92187 OF 2020  Nagpur Integrated Township Pvt. Ltd. … Appellant Versus  Maharashtra Real Estate Regulatory Authority, Mumbai  And Others … Respondents  SECOND APPEAL (St.) NO.92146 OF 2020  ALONG WITH  INTERIM APPLICATION NO.92153 OF 2020  Chourangi Builders & Developers Pvt. Ltd. … Appellant  Versus  Hansa Kishore Shah  And Others … Respondents  …..  Mr. Nirman Sharma i/b Sonu Tandon, for the Appellant in SAST/92158/2020 and SAST/92186/2020 and for Respondent No.3 in SAST/92146 of 2020.  Mr. Mayur Khandeparkar a/w Mr. Ranjeev Carvalho, Mr. Vikramjit Garewal, Ms. Sabeena Mahadik, Mr. Pankaj Uttaradhi and Mr. Aayush Kothari for Respondent No.3 in SAST/92158 and SAST/92186/2020 and for the Appellant in SAST/92146/2020. 1  Mr. Ramesh Tripathi, for Respondent Nos. 1 and 2 in SAST/92146/2020 and for Respondent No.2 in SAST/92186/2020. …..  CORAM : S.C. GUPTE  DATE : 11 SEPTEMBER 2020  ( JUDGMENT )  . These Second Appeals, which are connected, are heard together. Mr. Sharma, learned Counsel appearing for the Appellant in Second Appeal ( , seeks leave to withdraw the appeal. The second appeal is dismissed as withdrawn with no order as to costs. In view of the disposal of the second appeal, the Interim Application made therein does not survive and is also disposed of.  2 The two remaining second appeals, i.e. Second Appeal ( , raise significant points of law arising under the proviso to sub-section (5) of Section 43 of Real Estate (Regulation and Development) Act, 2016 (\"Act\"), concerning, particularly, pre-deposit to be ordered, when a promoter files an appeal with the Appellate Tribunal under sub-section (5) of Section 43 of the Act. The Appellants in both these appeals are claiming that they do not come under the expression \"promoter\"  used in the proviso and hence, are not liable to make any pre-deposit.  4 The Appellant in Second Appeal ( , i.e. 2  Chourangi Builders & Developers Pvt Ltd (\"Chourangi\"), was the original developer, who had issued allotment letters to the allottee flat purchasers contesting these appeals and who had entered into agreements for lease, covered by the Act, with them. The development rights, in pursuance of which these deocuments were executed, were originally conferred on Chourangi by Maharashtra Airport Development Company Limited (\"MADC\"), a Special Planning Authority under the Maharashtra Regional and Town Planning Act, 1966 for colonizing areas around Nagpur Airport. It appears that MADC subsequently terminated the development agreement in favour of Chourangi and appointed Nagpur Integrated Township Pvt. Ltd (\"NIT\") - companion appellant in Second Appeal (  - as a developer for the project. A tripartite agreement was thereupon entered into between MADC, Chourangi and NIT for taking over of the project by the latter. In pursuance of this tripartite agreement, Chourangi claims to have given an option to all its allottees including the Respondents herein to opt either for return of their monies paid for their allotments or substitute their agreements by agreements with NIT for the allotted premises; in either case, it was NIT, who was to be responsible for dealing with the allottees. There are disputes between the parties on various issues arising out of this arrangement, such as, whether, under the tripartite agreement, NIT could be said to be liable to the allottees for any lapse on the part of Chourangi prior to the execution of the tripartite agreement, or whether the allottees in the present case had opted for any 3  particular option, and if so, which, or whether, so far as the allottees in the two second appeals herein are concerned, which of the two, i.e. Chourangi and NIT, could be said to be a promoter ? A prima facie appreciation of these issues was necessary to decide the question of application of the proviso to sub-section (5) of Section 43 of the Act. Only after such appreciation could the Appellate Tribunal have passed a pre-deposit order either against Chourangi or against NIT or against both. Far from satisfying this mandate, what appears from the orders impugned herein by both Chourangi and NIT is that the Tribunal has passed orders of pre-deposit under the proviso against both without any discussion as to their respective status as promoter/s for the purposes of these appeals. An important question of law, besides the question on merit briefly indicated above, which immediately arises, as a result, is whether the Appellate Tribunal, whilst acting under sub-section (5) of Section 43 of the Act, could make an order of pre-deposit against any appellant before it without considering whether he is a \"promoter\" within the meaning of the proviso to that sub-section. The second appeals are, accordingly, admitted on this question of law and are taken up for hearing forthwith by consent of parties.  5 It is obvious that sub-section (5) of Section 43 of the Act entitles \"any person aggrieved by any direction or decision or order made by the authority or by an adjudicating officer\" under the Act to file an appeal. It is only when such appeal is filed by a promoter that the 4  proviso to sub-section (5) is attracted. When a promoter files an appeal with the Appellate Tribunal, such appeal cannot be entertained, by virtue of the proviso, unless the promoter first deposits with the Appellate Tribunal at least 30 per cent of the penalty or such higher percentage as may be determined by the Tribunal or of the total amount to be paid to the allottees including interest and compensation imposed on him, if any, or both, as the case may be. It may well be that an order for payment of compensation or damages is made by the authority or by the adjudicating officer under the Act against a party, without such party being in the position of a promoter within the applicable meaning of that expression. If such party were then to approach the Appellate Authority, there is no way the Appellate Authority could order pre-deposit against it under the proviso to sub-section (5) of Section 43. In other words, for the purpose of acting under the proviso to Section 43(5) of the Act, whether or not the Appellant is a promoter within the meaning of that expression used in the proviso, is a jurisdictional question to be decided by the Appellate Tribunal before any order of pre-deposit could be passed. This is not to say that the controversy, namely, whether the particular appellant before the Tribunal is such a promoter is to be finally decided by the Appellate Tribunal when its makes an order of pre-deposit. What is imperative is that whenever such question is legitimately raised and falls for consideration of the Tribunal, it must take at least a prima facie view of the matter and only thereupon pass an order of pre-deposit. 5  6 The Appellate Tribunal, in the present case, appears to have been completely oblivious of the controversy raised by both appellants in these appeals; it does not even refer to the question as to whether Chourangi or NIT or both could be termed as 'promoters' within the meaning of that expression under the proviso to sub-section (5) of Section 43. This obviously cannot be countenanced. For the reasons, more particularly indicated above, it was imperative for the Tribunal to at least take a prima facie view on this issue and only then proceed to order pre-deposit against either Chourangi or NIT or both. The impugned order, thus, deserves to be quashed and set aside.  7 Both second appeals, i.e. Second Appeal ( , are, accordingly, allowed, by quashing and setting aside the impugned common order dated 18 August 2020, and remitting the appeals to the Appellate Tribunal for making a fresh order under the proviso to sub-section (5) of Section 43 in the light of the observations made hereinabove.  8 It is made clear that whilst passing this order, this court has not applied its mind to the merits of the controversy, particularly, whether either of the Appellants before this court or both could be termed as promoters within the meaning of that expression under the proviso of sub-section (5) to Section 43 of the Act, and also whether, if both are to be considered as promoters, the whole of permissible pre-deposit could have been ordered against both. These questions are 6  to be considered by the Tribunal at the remand hearing. All rights and contentions of the parties in that behalf are kept open.  9 Both second appeals are disposed of accordingly. Considering the fact that this is an old matter which deserves to be disposed of early, the Appellate Tribunal is requested to consider the matter as expeditiously as possible and preferably within two months from today.  10 In view of the disposal of the second appeals, the Interim Applications, namely, Interim Application  , respectively, made therein do not survive and are also disposed of.  11 This order will be digitally signed by the Personal Assistant of this Court. All concerned will act on production by fax or email of a digitally signed copy of this order.  (S.C. GUPTE, J.) 7"} ,
{"title": "Rustam Phiroze Mehta v. State Of Maharashtra", "date": null, "summary": "WRIT PETITION (ST) NO. 3221 OF 2020 [HON'BLE SHRI JUSTICE S.J. KATHAWALLA, HON'BLE SHRI JUSTICE MILIND N. JADHAV] \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t Order 21 Rule 32 of CPC. Rules 8, 10, 22 and 24 Section 14(1) of the Contempt Act read with Rule 4 Section 263 and Section 267 read with Rule 17 of the Maharashtra Realisation of Land Revenue Rules, 1967, Section 2(b) of the Contempt of Courts Act, 1971. Order XXTI Rule 41(2) of the code Article 215 of the Constitution of India and the Contempt of Courts Act, 1971. Rules 8, 9, 10, 22 and 24 of the said Rules Order 39 Rule 2A of the Code of Civil Procedure Indian Penal Code, 1860 and the Maharashtra Ownership of Flat Purchasers Act, 1963. 9.19. Section 14 of the Contempt of Courts Act read with Rule 4 of the Appellate Side Rules, 1960, Order 21 Rule 41(3) of the Code of Civil Procedure, 1908 Section 2(d) of the Real Estate (Regulation and Development) Act, 2016 (the said Act). Respondent No.1 \n  Shri Rustam Phiroze Mehta v. The Collector, Pune District and The Tahsildar, Pune City\n  \n  This case involves a Writ Petition filed by the Petitioner, Shri Rustam Phiroze Mehta, seeking a writ in the nature of Mandamus or any other appropriate writ against Respondent Nos. 2 and 3, mandating them to comply with the Order-cum-Directions issued by the Maharashtra Real Estate and Regulatory Authority. The Petitioner was allowed to amend the Petition and seek further interim reliefs against Respondent No. 4, Marvel Sigma Homes Private Limited. The Petitioner alleges that the Collector and the Tahsildar failed to comply with the directions issued by the Maharashtra Real Estate and Regulatory Authority. The Petitioner seeks temporary injunction and a direction for Respondent No. 4 to deposit the principal sum payable to the Petitioner.\n  \n  The Court finds that a strong prima facie case has been made out to consider the grant of interim reliefs in favor of the Petitioner. The Court also holds that the Writ Petition is maintainable against a Private Limited Company. The Court further notes that the Supreme Court has approved the approach of seeking disclosure of assets of group companies. Costs will be considered at the stage of final disposal of the Writ Petition.\n  \n  The Court grants the interim reliefs sought by the Petitioner and directs Respondent No. 4 to comply with the Order-cum-Directions issued by the Maharashtra Real Estate and Regulatory Authority. The Court also holds that the Writ Petition is maintainable against a Private Limited Company.\n  \n  The Court finds that Respondent Nos. 2 and 3 have failed to discharge their statutory duties to secure recovery of the Decretal Amounts. The Court also notes that the Writ Petition is maintainable under Article 226 of the Constitution of India. The Court relies on previous judgments and observations of the Supreme Court to support its decision to grant interim reliefs. The Court rejects the argument of Respondent No. 4 that no reliefs can be granted against a Private Limited Company.\n  \n  Costs will be considered at the stage of final disposal of the Writ Petition.\n  ( . KATHAWALLA, J.) 1. By the above Writ Petition Shri Rustam Phiroze Mehta (‘the Petitioner’) has prayed for a writ in the nature of Mandamus or any other appropriate writ against Respondent Nos. 2 and 3, i.e. The Collector, Pune District and The Tahsildar, Pune City respectively, mandating them to comply with the Order-cumDirections dated 15\" April, 2019 issued by the Maharashtra Real Estate and Regulatory Authority, Mumbai. By an Order dated 20\" January, 2021 the Petitioner was allowed to amend the Petition and seek further ad-interim / interim reliefs against Respondent No. 4 - Marvel Sigma Homes Private Limited which reliefs are sought in aid of the final relief. 2. Admit. 3. By this Order, we will consider whether the Petitioner is entitled to the following interim reliefs as sought in the present Writ Petition (as amended pursuant to Order dated 20\" January, 2021): “b)(ti) That pending the hearing and final disposal of the present Petition, Respondent No.4 and/or its group companies, their officers, servants, agents, assigns, representatives and any other person, claiming through or under them, be restrained by a temporary injunction from directly or indirectly in any manner selling, transferring or creating any third party rights in any of their movable or immovable properties; b)(tat) That pending the hearing and final disposal of the present Petition, this Hon?ble Court be pleased to direct Respondent No.4 to deposit the principal sum of Rs.11,36,33,625/- admittedly payable by Respondent No. 4 to the Petitioner or any other amount as this Hon’ble Court may deem fit, to be appropriated towards the decretal amount payable by the Respondent No. 4 to the Petitioner.” 4. Apart from considering whether the Petitioner is entitled to the above interim reliefs sought in prayer clauses b(ii) and b(ili) reproduced hereinabove, we will also consider herein whether Respondent No. 4 acting through its Director, Shri Vishwajeet Jhavar (‘Shri Jhavar’) has interfered with the administration of justice by breaching various Orders of Disclosure passed by this Court against Respondent No. 4 by filing false Affidavits of Disclosure. If we are prima facie satisfied of such conduct, we will then proceed to consider what action ought to be taken in relation to such breach, keeping in mind the fact that this is not a Contempt Petition under the Contempt of Courts Act, 1971 (‘Contempt of Courts Act’) but a Writ Petition under Article 226 of the Constitution of India. SUBJECT MATTER OF THE PRESENT WRIT PETITION: 5. The present Writ Petition (L) No. 3221 of 2020 has been filed by the Petitioner who was the Original Complainant before the Maharashtra Real Estate Regulatory Authority (“RERA’). The Petitioner is an “allottee” as defined under Section 2(d) of the Real Estate (Regulation and Development) Act, 2016 (‘the said Act’). Respondent No.1 is the State of Maharashtra. Respondent No.2 is the Collector, Pune (‘the Collector’). Respondent No.3 is the Tahsildar, Pune (‘the Tahsildar’). Respondent No. 4 is Marvel Sigma Homes Pvt. Ltd. (‘Respondent No. 4’), a Company engaged in the business of development and construction. 5.1. The Petitioner had filed Complaint No. CC005000000010528 (‘the Complaint’) under Sections 12, 14, 18 and 19 of the said Act against Respondent No. 4. The main grievance in the Complaint before RERA was that under Articles of Agreement dated 1° August 2014, the Petitioner paid the entire consideration of Rs.10,61,18,790/- to Respondent No. 4 towards purchase of Flat No. 1001 admeasuring 326.55 sq. mtrs., on the 10th floor, ‘A’ Wing in Respondent No. 4’s Project ‘Marvel Ribera’ at Pune, alongwith two covered car parking spaces and an open terrace admeasuring 119.10 sq. mtrs. (Carpet area) collectively referred to as (‘the said Premises’) and that there was a gross delay in handing over possession of the said Premises. Therefore, the Petitioner filed the Complaint seeking return of the amount paid and interest thereon, including compensation under the aforesaid provisions of RERA. 5.2. By an Order dated 1* March, 2018, (‘the said Order’), the Adjudicating Officer allowed the said Complaint and directed Respondent No. 4 to pay Rs.14,05,57,705.46 (Rupees Fourteen Crores Five Lakhs, Fifty-Seven Thousand Seven Hundred and Five and Forty-Six Paisa only) along with interest at the rate of 10.05% p.a. (‘the Decretal Amount’) to the Petitioner. 5.3. As Respondent No. 4 failed to pay the Decretal Amount, the Petitioner initiated execution proceedings against Respondent No. 4. The said execution proceedings were allowed by RERA and consequently RERA issued a Recovery Certificate dated 12\" April, 2019, against Respondent No. 4 for recovering the Decretal Amount as arrears of land revenue. Thereafter, RERA on 15\" April, 2019, vide its Letter of even date, directed the Collector to execute the said Recovery Certificate. A copy of this Letter was not forwarded to the Petitioner. By its Letter dated 4\" June, 2019, the Collector directed the Tahsildar to execute the Recovery Certificate. The earlier Letter of RERA dated 15\" April, 2019 addressed to the Collector was referred to therein. A copy of this Letter dated 4° June, 2019 was forwarded to the Petitioner. According to the Petitioner, despite the aforesaid direction dated 15\" April, 2019, the Collector and the Tahsildar both failed to comply with the said direction and failed in performing their statutory obligations. The Petitioner addressed a letter to Respondent No. 3 - Tahsildar calling upon him to take steps for realising the amount due to the Petitioner. As there was no action taken by Respondent No. 3 - Tahsildar and Respondent No. 2 - Collector, the Petitioner filed the present Writ Petition under Articles 226 and 227 of the Constitution of India, seeking issuance of a Writ of Mandamus against the Collector and Tahsildar to comply with the Direction dated 15\" April, 2019 and to perform their statutory duties to recover the amounts under the Recovery Certificate as arrears of land revenue. According to the Petitioner, till today an amount of approximately Rs.17,45,50,137.14/- (Rupees Seventeen Crores Forty-Five Lakhs Fifty Thousand One Hundred Thirty- Seven and Fourteen Paisa Only) is due and payable by the Respondent No. 4 to the Petitioner. 5.4. In aid of the final relief that is sought against the Respondent Nos. 2 and 3, the Petitioner seeks interim reliefs against Respondent No. 4 and its group companies, so that the amount to be paid to the Petitioner under the Recovery Certificate is protected till such time as the statutory authorities secure the recovery of the same as arrears of land revenue. ORDER DATED 9\" MARCH, 2021: 6. After the present Writ Petition was filed by the Petitioner and various Orders of Disclosure were passed against Respondent No. 4, which are referred to below, Respondent No. 4 filed Interim Application (L) No. 2044 of 2021 challenging the maintainability of the present Writ Petition. Respondent No. 4 also filed Writ Petition No. 2657 of 2020 challenging the Direction dated 4\" June, 2019 issued by the Collector directing the Tahsildar to execute the Recovery Certificate dated 12\" April, 2019 issued by RERA against Respondent No. 4. Since Respondent No. 4 challenged the maintainability of the present Writ Petition, this Court considered it necessary to decide the said Interim Application before considering the application for interim reliefs in this Writ Petition. As the grounds of challenge with respect to the maintainability of the present Writ Petition raised in the aforesaid Interim Application filed by Respondent No. 4 and the challenge to the manner of execution of the Recovery Certificate in Writ Petition No. 2657 of 2020 also filed by Respondent No. 4, were substantially the same, both were heard together. 6.1. By an Order and Judgment dated 9\" March, 2021, the aforesaid Interim Application and Writ Petition No. 2657 of 2020 were dismissed, and the hearing of the present Writ Petition including the application for interim reliefs sought by the Petitioner, were directed to proceed. We were informed that Respondent No. 4 has filed a Special Leave Petition against the Order and Judgment dated 9\" March, 2021. It appears that the Special Leave Petition has not been circulated for listing and there is no stay in relation to the present proceedings. ISSUES FOR CONSIDERATION : 7. Pursuant to the Order dated 9\" March, 2021, we proceeded to hear the present Writ Petition. The two issues which have fallen for our determination are as under : 7.1. Whether Respondent No. 4 and its Director Shri Jhavar have interfered with the administration of justice by filing false and incorrect Affidavits of Disclosure and by also violating and breaching various Orders of this Court?; If so, the consequences of such breach? 7.2. Whether the Petitioner is entitled to interim reliefs set out in the prayer clauses (b)(ii) and (b)(iii) of the present Writ Petition, especially considering that Respondent No. 4 is a Private Limited Company? FACTUAL BACKGROUND : 8. Since the factual background of the disputes has been set out in detail in the Order dated 9 March, 2021, we are not repeating the same in the present Order. The relevant facts have also been set out in the earlier paragraphs of this Order. ORDERS OF THE COURT AND AFFIDAVITS OF THE RESPONDENTS: 9. Before recording the submissions of the parties on the issues set out in paragraph 7 hereinabove, it is necessary to set out in detail the events that transpired during the hearing of the present Writ Petition. 9.1. On 3\" March, 2020, after hearing the Advocates for the parties and being prima facie satisfied that there had been inaction by the Collector and the Tahsildar in performing their statutory duties and complying with the aforesaid Direction dated 15\" April, 2019, issued to them by RERA, the Tahsildar was directed to remain present before this Court on 5\" March, 2020. 9.2. On 5™ March, 2020, the Tahsildar could not remain present and requested this Court to keep the matter on 6 March, 2020. In view thereof, the matter was adjourned to 6\" March, 2020. 9.3. On 6\" March, 2020, the Tahsildar personally remained present before this Court. On the same date, the Tahsildar filed an Affidavit in Reply to the Petition. It states that after receiving the said Direction dated 15\" April, 2019 from RERA, his office had issued two Demand Notices dated 11\" September, 2019 and 10\" January, 2020 respectively to Respondent No. 4, calling upon Respondent No. 4 to pay the said Decretal Amount. Respondent No. 4 failed to respond to these Demand Notices. The Tahsildar then carried out a search of Respondent No. 4’s properties and came across Property Cards in the name of Marvel Imperial Co-operative Housing Society Ltd., Marvel Crest Condominium, etc. However, the Affidavit states that as the name on these Property Cards was not the same as that of Respondent No. 4, i.e. ‘Marvel Sigma Homes Pvt. Ltd.’, the Tahsildar could not execute the said Recovery Certificate against Respondent No. 4. The stand of the Tahsildar in justification of him not having taken any steps towards recovery of the amounts mentioned in the RERA Recovery Certificate, is reproduced hereunder : “6. I say that as per direction of the RERA, the Respondent No. 3 started the procedure by sending two notices and searching the property of Respondent No. 4, movable as well as immovable for attachment. But, due to closure of 7/12 extract, it is difficult to find out the property of the Respondent No. 4. I further say that recently, the office of the undersigned got property card of similar name of the Respondent No. 4. However, after going through the said property card, it is revealed that the title name is different i.e. Marvel Imperial Co-operative Housing Society Ltd., City Survey No. 260, area 9875.76 sq. mtrs. The second similar name t.e. Marvel Crest Condominium, City Survey No. 363.929 sq. mtr. The third similar name ts i.e. Goel Ganga Construction & Real Estate Pyt. Ltd., City Survey No. 207, area 11027.68 sq. mtrs. Hereto annexed and marked as Exhibit 5 Colly. are copies of the Property Cards. 7. I say that as the address provided by RERA is different from property card and Respondent No. 4’s property and hence, our office is facing difficulty in searching the property of the Respondent No. 4 for attachment and further procedure. I say that our office had started the proceeding from 12.06.2019 however, due to different title and address, it is difficult to us to search Respondent No. 4’s property and to complete further procedure. I say that hence, there is no delay from our side in the abovesaid matter. If the Hon’ble Court directs the Respondent No. 4 i.e. defaulters to give proper title name and address and mention the whole property of Respondent No. 4, it will be easy for us to attach and recover the due amount from Respondent No. 4 and hand over the said due amount to the Petitioner.” 9.4. In addition to referring to the averments in the Affidavit of the Tahsildar, we have also perused the extract of the Property Card annexed to the Affidavit itself. Contrary to the Tahsildar’s understanding that names and addresses in the Property Card are different from those mentioned in the Recovery Certificate, the Property Card itself indicates that one of the projects or developments, namely, Marvel Crest, is a property or project in the name of Respondent No. 4. 9.5. In view of the aforesaid submissions made by the Tahsildar, a statement was made on behalf of Respondent No. 4 that they shall file an Affidavit setting out the assets of Respondent No. 4 and its group entities within one week. The said statement was accepted by this Court and the following Order dated 6\" March, 2020 was passed : “1. Respondent No. 4 states that the disclosure Affidavit in Reply setting out the assets of the Respondent No. 4 and its group entities shall be filed within one week from today. This statement is accepted.” 9.6. On 11 March, 2020, Respondent No. 3 - Tahsildar, Pune, addressed a Letter to RERA stating that she was unable to locate any assets standing in the name of Respondent No. 4 and was therefore unable to execute the Order dated 15\" April, 2020. This Letter was produced by the Petitioner as part of a Compilation of Documents. It has not been disputed by any of the parties. 9.7. Pursuant to the Order of 6 March, 2020, Shri Jhavar, Director of Respondent No. 4, filed an Affidavit of Disclosure dated 12° March, 2020 (“1 Disclosure Affidavit”). In the 1* Disclosure Affidavit, Respondent No. 4 only made a disclosure with respect to its Project ‘Marvel Ribera’, at Boat Club Road, Pune, in which the Petitioner had purchased the said Premises. Respondent No. 4 disclosed that, (i) the said Project ‘Marvel Ribera’ had a total of 27 flats, (ii) out of the total 27 flats, 11 have been sold and an amount of Rs. 18,54,05,681/- was receivable from the said flats, (iii) the remaining 16 flats are unsold, but were mortgaged to ICICI Home Finance Ltd. under a Mortgage Deed dated 29\" May, 2017. Further in paragraph 7, Respondent No. 4 made a statement that, “Marvel Sigma Homes Private Limited apart from above has no other property”. (Emphasis supplied). 9.8. Thereafter due to the extended lockdown and suspension of physical hearings in this Court due to the Covid-19 pandemic, this matter could be taken up only on 14\" January, 2021. At that time, the Advocates for the Petitioner informed this Court that by the aforesaid Order dated 6\" March, 2020, Respondent No. 4 was directed to disclose “all” assets of Respondent No. 4 and its group entities. Despite the said Order, Respondent No. 4 had only disclosed details in respect of one of its Projects and had not disclosed its other assets. In support of his contention the Petitioner filed a Compilation of Documents comprising of details of the various projects of Respondent No. 4 and its group entities as available on the official website of RERA, the sold and unsold units therein, etc., that constituted the assets of Respondent No. 4, which Respondent No. 4 had not disclosed in its 1* Disclosure Affidavit. 9.9. After perusing the 1* Disclosure Affidavit and the aforesaid Compilation of Documents filed by the Petitioner, it was clear that Respondent No. 4 had violated the Order dated 6\" March, 2020 and had not disclosed, (i) all other assets of Respondent No. 4; (ii) all assets of its group entities; (iii) details as to when the amount of Rs. 18,54,05,681/- was receivable from the purchasers of the sold units in Marvel Ribera; (iv) the sold and unsold units in Respondent No. 4’s projects, vez. Marvel Bounty, Marvel Cascada, Marvel Crest, etc.; (iv) the sold and unsold units in projects of its group entities, viz. Marvel Fuego, Marvel Arco, Marvel Cerise, Marvel Aurum, Marvel Sangria, Marvel Ideal Spacio, etc.; (v) bank account details of Respondent No. 4 and its group entities, monies lying therein and other investments and (vi) other immovable assets of Respondent No. 4 and its group entities. 9.10. In view of the aforesaid, this Court by its Order dated 14\" January, 2021 noted the aforesaid breach by Respondent No. 4 and granted an opportunity to Respondent No. 4 to comply with the Order dated 6\" March, 2020 in its true letter and spirit and adjourned the matter to 20\" January, 2021. By the said Order dated 14\" January, 2021, this Court directed as under: “3. Instead of issuing notice at this stage calling upon the Director of Respondent No. 4 to show cause as to why action should not be taken against him for breach of the statement made before this Court on 6th March, 2020, we are giving an opportunity to Mr. Vishwajeet Subhash Jhavar, Director of Respondent No. 4 - Marvel Sigma Homes Private Limited, to comply with his statement as recorded and accepted in our Order dated 6th March, 2020, on or before the adjourned date. Needless to add that the said statement shall be complied with in its true letter and spirit.” (Emphasis supplied). 9.11. Thereafter, Shri Jhavar on behalf of Respondent No. 4 filed an Affidavit of Disclosure dated 19\" January, 2021 (“2\"™ Disclosure Affidavit”), wherein Respondent No. 4 enclosed a Statement of Assets and Liabilities of Respondent No. 4 and its seven group entities, viz. (i) Marvel Realtors & Developers Ltd., (ii) Marvel Omega Builders Pvt Ltd. (iii) Marvel Zeta Developers Pvt. Ltd. (iv) Marvel Landmarks Private Limited (v) PAX Homes LLP (vi) Hallmark Marvel Realtors and (vii) Marvel Realtors. In the said Statement, Respondent No. 4 disclosed, (i) names of certain projects of Respondent No. 4 and the said seven group entities; (ii) sold and unsold area in the disclosed projects; (iii) cumulative bank balances lying in the bank accounts of Respondent No. 4 and the seven group entities; (iv) encumbrances over the disclosed projects. 9.12. On 20\" January, 2021, when the matter came up for hearing, the Advocates for the Petitioner informed this Court that despite this Court granting an opportunity to Respondent No. 4 to comply with the Order dated 6\" March, 2020 in its true letter and spirit, Respondent No. 4 had once again provided an incomplete and misleading Disclosure. The Advocates for the Petitioner tendered a list of group companies and LLPs of Respondent No. 4, as available on the official website of the Ministry of Corporate Affairs, which showed that Respondent No. 4 had not disclosed assets of 12 group companies and 4 LLPs. The Advocates for the Petitioner also informed this Court that even for the entities disclosed, Respondent No. 4 had only provided partial details and had not disclosed, (a) details of each of the bank accounts of these entities and monies lying therein; (b) particulars of each of the bank accounts of disclosed entities/projects; (c) sold and unsold units in projects of these disclosed entities and monies receivable from the sale of these units; (d) other movable assets and investments of these entities. 9.13. In view of the repeated breaches by Respondent No. 4 in complying with the Orders passed, this Court directed Shri Jhavar to remain personally present in Court on 25\" January, 2021. 9.14. On 25\" January, 2021, Shri Jhavar was personally present before this Court. On that day the Advocate appearing on behalf of Respondent No. 4 informed this Court that in compliance of the Order dated 6 March, 2020, they now had “all” documents ready. The Court then granted another opportunity to Respondent No. 4 to comply with the Orders of this Court and directed Respondent No. 4 to place the said documents on Affidavit and furnish a copy of the same to the Advocate for Petitioner by 27\" January, 2021, and the matter was adjourned to 2™ February, 2021. 9.15. Pursuant thereto, Shri Jhavar filed an Affidavit of Disclosure dated 27\" January, 2021 (“3\" Disclosure Affidavit”). By the 3™ Disclosure Affidavit, Respondent No. 4 produced/disclosed (i) Statement of Assets and Liabilities of Respondent No. 4 and its aforesaid seven group entities; (ii) List of sold and unsold units of some of the projects of Respondent No. 4 and the said seven group entities; (iii) Uncertified Bank Statements of some bank accounts of Respondent No. 4 and the said seven group entities and (iv) Mortgage Documents in respect of the assets owned by Respondent No. 4 and some of its said seven group entities. Further in paragraph 3 of the 3“ Disclosure Affidavit, Respondent No. 4 made the following statement: “3. I say that since the Respondent No. 4 and its other companies are vast, there might be some of the assets/projects/receivable, which inadvertently are not stated in the Affidavits, the Respondent No. 4 crave leave of Hon’ble Court to put the said properties on affidavits if the same is pointed to us.” (Emphasis Supplied) 9.16. On 2\" February, 2021, the Advocates for the Petitioner informed this Court that even the 3\" Disclosure Affidavit was incomplete and Respondent No. 4 had once again filed the Disclosure Affidavit only in respect of Respondent No. 4 and the said seven group entities despite the Petitioner on the previous occasion pointing out the various other group entities of Respondent No. 4. In view of the aforesaid, by our Order dated 2™! February, 2021, we directed the Petitioner to file an Affidavit setting out all the non-disclosures / breaches by Respondent No. 4 and the matter was adjourned to 10\" February, 2021. 9.17. On 8\" February, 2021, the Tahsildar levied a charge for Rs. 6,25,20,100/- on the Respondent No. 4’s land bearing no. 30/A, Boat Club Road, Pune. 9.18. The Petitioner filed an Affidavit dated 9\" February, 2021, setting out the repeated breaches of Respondent No. 4 in complying with the aforesaid Orders passed by this Court. The Petitioner by the said Affidavit stated as under: 9.18.1. That despite being given multiple opportunities to comply with the Orders passed by this Court, Respondent No. 4 had deliberately and willfully failed to comply with these Orders and that the Respondent No. 4 even after filing three Disclosure Affidavits, had failed to disclose the following assets: \"a. Assets of 18 group entities of Respondent No. 4. b. Inventory of sold and unsold flats in the following projects zz. (i) Marvel Izara (ii) Marvel Tupe (iv) Marvel Cerise (v) Marvel Chaitanya (vi) Marvel Vimannagar (vii) Marvel Ideal Spacio (viii) Marvel Brisa (ix) Marvel Cetrine (xii) Marvel Aries (xiii) Marvel Cascada (xiv) Marvel Crest (xv) Marvel Castella (xvi) Marvel Arista (xvii) Marvel Merlot (xviii) Marvel Zephyr, etc. c. Details of all the bank accounts of Respondent No. 4 and the seven disclosed entities. d. Bank account details of the following projects being owned and developed by Respondent No. 4 and the said seven entities were not disclosed - Marvel Castella, Marvel Crest, Marvel Ecaso, Marvel Senitel, Marvel Merlot, Marvel Zephyr, Marvel Isola, Marvel Amora, Marvel Claro, Marvel Diva, Marvel Arista. e. From the unsold units in the disclosed projects, Respondent No. 4 failed to disclose which flats were mortgaged.\" 9.18.2. That Marvel Precast Structures India LLP, one of the aforesaid 18 entities, was actively carrying on the business of manufacturing fabricated metal products. A perusal of the balance sheet of Marvel Precast, downloaded from the MCA Website, showed that the current assets of Marvel Precast amounted to Rs. 1,11,53,002/-, which included trade receivables of Rs. 1,50,044/-, cash & cash equivalents of Rs. 8,62,459/- and Rs. 95,73,580/- being an amount advanced by way of loan and advances to third parties/vendors. The details also showed that there was no charge on the assets of the said LLP. 9.18.3. That Marvel Ora Residences LLP, one of the aforesaid 18 entities, was also actively carrying on its business. As per the Balance Sheet for FY 2019 - 2020, the value of its current assets was Rs. 59,99,94,667/- and current capital account was Rs.18,86,91,887/-. Further, the current assets included cash equivalent of Rs. 5,745/-, short term loans advanced by Marvel Ora amounting to Rs. 59,99,94,667/- (advanced to related parties) and other current assets amounting to Rs. 55,27,180/-. Further, as per the records available on the official website of the Ministry of Corporate Affairs, there was no charge on the assets of this entity. 9.18.4. That in the Statement of Assets and Liabilities annexed to the 3\" Disclosure Affidavit read with the Mortgage Documents filed by Respondent No. 4, Shri Jhavar on behalf of Respondent No. 4, sought to represent that Respondent No. 4 was debt ridden and all its projects and the unsold units therein were mortgaged to various banks and/or financial institutions due to which it was unable to pay the said Decretal Amount. However, contrary to the aforesaid representation, Shri Jhavar on 20\" September, 2020 had addressed an email to all its customers/purchasers inter alia informing them that in the last 18 months Marvel Group had sold over 1000 units across their various projects, including Marvel Cerise, Marvel Arco, Marvel Brisa, Marvel Ecaso, Marvel Cascada, etc. and had been simultaneously successful in reducing its debt by 70% and have a target to be debt-free by March 2021. The Petitioner stated that this clearly showed that Respondent No. 4 has been consistently making false and misleading statements regarding its financial status before this Court to suit its benefit. 9.18.5. That Respondent No. 4. on_ its Official § Website, www.marvelrealtors.com, has stated that it was one of the “Top Real Estate Developers in Pune” and has developed various projects in Pune and Bangalore. Further, it was also stated on the Website that Respondent No. 4 and its group entities had completed 35 projects in Pune and Bangalore. Further it was stated that Respondent No. 4 and its group companies were currently developing 10 projects in Pune, viz. Marvel Piazza, Marvel Ideal Spacio, Marvel Fria, Marvel Acquanas, Selva Ridge, Marvel Ribera, Marvel Aurum, Marvel Basilo, Marvel Ecaso, Marvel Isola and 2 projects in Bangalore viz. Marvel Arista and Marvel Orial. 9.18.6 That Respondent No. 4 had several FIR’s registered against it for offences punishable under the Indian Penal Code, 1860 and the Maharashtra Ownership of Flat Purchasers Act, 1963. 9.19. Thereafter, Respondent No. 4 filed its Affidavit of Disclosure dated 16\" February, 2021 (“4™ Disclosure Affidavit”), without any liberty being granted to Respondent No. 4 to file such Affidavit. In any event, we accepted the said Affidavit and took it on record. By the said Affidavit, Respondent No. 4 sought to justify the non-disclosures of Respondent No. 4, as pointed out by the Petitioner in its aforesaid Affidavit dated 9\" February, 2021. The explanation provided by Respondent No. 4 in the 4\" Disclosure Affidavit is summarized as under: 9.19.1. That in its 1* Disclosure Affidavit, it disclosed only assets in Marvel Ribera because they were under the impression that the assets in the said project were “sufficient” to comply with the Order dated 6\" March, 2020. 9.19.2. Respondent No. 4 admitted that it had only provided disclosure of bank accounts of its “major” entities. 9.19.3. Respondent No. 4 admitted that it had not provided details of certain projects as they were “completed” and therefore the disclosure was “irrelevant”. The said statement / admission statement of Respondent No. 4 is reproduced hereunder: “3. I say that myself have already disclose the bank accounts of major entities. I say that so far as remaining entities are concern, following is the detail chart as to the status of the said bank accounts and perusal of the said chart would itself make it clear that most of the projects are complete and therefore the disclosure of the same was irrelevant. 9. ...1 say that major projects has already been disclosed by me. I say that so far as the Petitioner contention is concern in respect of remaining projects; I say that the said are irrelevant in respects of the present subject matter.” (Emphasis supplied) 9.19.4. Respondent No. 4 sought to disclose details of assets of following projects: Marvel Castella, Marvel Crest, Marvel Ecaso, Marvel Senitel, Marvel Selva Ridge, Marvel Orial, Marvel Sangria, Marvel Fria, Marvel Piazza, Marvel Izarra, Marvel Amora, Marvel Claro, Marvel Diva. 19.5. Respondent No. 4 admitted that it had not filed disclosure of other group entities because the same was “irrelevant”. Respondent No. 4 by this Affidavit sought to provide a status of the other group entities. It is necessary to reproduce this statement of Respondent No. 4: “4, So far as para No. 15 is concerns, I say that myself has disclose the information of the major group entities. I say that so far as the other group entities are concern the disclosure of the same was irrelevant and the below chart would clearly reflect the same.\" (Emphasis supplied) 9.19.6. Respondent No. 4 admitted that it had only disclosed “major projects” and did not disclose other projects as their details were “irrelevant”. 9.20. According to the Petitioner, even the 4 Disclosure Affidavit was incomplete and false for the following reasons: 9.20.1. Respondent No. 4 only disclosed bank account numbers of the projects Marvel Castella, Marvel Crest, Marvel Ecaso, Marvel Senitel, Marvel Selva Ridge, Marvel Orial, Marvel Sangria, Marvel Fria, Marvel Piazza, Marvel Izarra, Marvel Amora, Marvel Claro, Marvel Diva. No bank statement or details of monies lying therein were disclosed for these Projects. 9.20.2. According to Respondent No. 4’s official website, projects Marvel Orial, Marvel Fria, Marvel Piazza, Marvel Selva Ridge are ‘ongoing’ projects, which Respondent No. 4 falsely represented as ‘completed’. The websites and other information of the Marvel Group that are available online clearly establish this. 9.20.3. No disclosure of sold / unsold inventory is made with regard to Marvel Izara, Marvel Zephyr, Marvel Cerise, Marvel Ideal Spacio, Marvel Brisa, Marvel Citrine, Marvel Arise, Marvel Cascada, Marvel Crest, etc. 20.4. Even in respect to the entities referred to in the chart / table below paragraph 4 (described as ‘other group entities whose disclosure is irrelevant’), it is clear that there were assets that ought to have been disclosed even if those entities are not carrying out any projects. This would include disclosure of unsold inventory of Kappa Infra Ventures Private Limited; the land owned by Marvel Luxury Realtors Private Limited; the land or consideration for sale of land by Marvel Mega Realtors Private Limited; the current assets including the receivables of Marvel Precast Structures India LLP and Marvel Ora Residences. 9.21. According to the Petitioner, despite having filed four Disclosure Affidavits, Respondent No. 4 has still not fully complied with the aforesaid Orders dated 6\" March, 2020 and 14\" January, 2021, passed by this Court and the following assets still remain undisclosed: 9.21.1 Details/particulars of when the amount of Rs. 18,54,05,681/- is receivable from sold units in ‘Marvel Ribera’. 9.21.2. Movable and Immovable assets of the following entities - Kappa Infra Ventures Pvt. Ltd., Marvel Skyscrapers Pvt. Ltd., Marvel Dreamland Homes Pvt. Ltd., Marvel Foundation, Marveledge Realtors Pvt. Ltd., Epsillon Real Estate Pvt. Ltd., Marvel Asta Constructions Pvt. Ltd., Kappa Homes LLP, Marvel Precast structures India LLP, Marvel Ora Residences LLP, Marvel Group Holdings and Investments LLP, Marvel Elegant Homes LLP. 9.21.3. Bank account statements and details of monies lying therein for the following projects owned by Respondent No. 4 and its group entities viz. Marvel Castella, Marvel Crest, Marvel Ecaso, Marvel Senitel, Marvel Piazza, Marvel Merlot, Marvel Zephyr, Marvel Isola, Marvel Amora, Marvel Claro, Marvel Diva, Marvel Arista. 9.21.4. Even for projects disclosed, all bank account details have not been provided. 9.21.5. Inventory of sold and unsold flats for the following projects owned and developed by Respondent No. 4 viz., (i) Marvel Aries (ii) Marvel Cascada (iii) Marvel Crest and (iv) Marvel Castella. 9.21.6. Inventory of sold and unsold flats for the following projects owned and developed by the group entities of Respondent No. 4 viz., (i) Marvel Izara (11) Marvel Tupe (ili) Marvel Cerise (iv) Marvel Chaitanya (v) Marvel Vimannagar (vi) Marvel Ideal Spacio (vii) Marvel Brisa (viii) Marvel Cetrine (ix) Marvel Arista (x) Marvel Merlot (xi) Marvel Zephyr, etc. 9.21.7. Marvel Precast Structures India LLP and Marvel Ora Residences LLP, are two group entities whose financial statements and assets were not disclosed. The Petitioner states that this is significant because both of them disclose substantial current assets in their financial statements. In the case of Marvel Ora Residences LLP, the current assets amount to Rs. 59,99,94,667/- and the capital account reflects an amount of Rs. 18,86,91,887/-. This entity appears to have given a short-term loan to another group entity. The Petitioner states that these details have been withheld in the earlier disclosures because it would show the capacity of Respondent No. 4 and its related entities to satisfy the Recovery Certificate, which it is obstructing. ORDER PASSED BY THE SUPREME COURT OF INDIA : 10. On 28\" February, 2021, after this Court had granted three opportunities to Respondent No. 4 to fully comply with the Orders of Disclosure dated 6\" March, 2020 and 14\" January, 2021, and the Respondent No. 4 had filed three Disclosure Affidavits, Respondent No. 4 challenged these Orders by filing SLP (C) No. 2122/2021 and SLP (C) No. 2123/2021 before the Supreme Court. 10.1. By an Order dated 12\" February, 2021, the Supreme Court while upholding the approach adopted by this Court, dismissed the said SLPs. By the said Order, the Supreme Court held as under: “We give our full imprimatur to the approach adopted by the High Court to ensure that in one manner or the other the petitioner honours the decree which has been passed against him. The Special Leave Petition is dismissed. Pending applications stand disposed of.” (Emphasis supplied) It is relevant to note here that Respondent No. 4 never served a copy of the said SLPs upon the Petitioner. The Petitioner had not filed a caveat before the Supreme Court and was therefore not aware of the filing of the SLP or the Order. Further Respondent No. 4 also suppressed the aforesaid Order dated 12\" February, 2021 from this Court, despite the matter having been heard after that. This Court learnt of the aforesaid Order only upon receiving a copy of it from the Supreme Court Registry. In fact, Advocate Shri Amit Gharte representing Respondent No. 4 before us informed us that even he was not aware of the SLP’s being filed by Respondent No. 4 before the Supreme Court, since the same were filed by engaging some other Advocates. SUBMISSIONS OF THE PARTIES: ISSUE NO. 1: AS SET OUT IN PARAGRAPH 7.1.: 11. Shri Sharan Jagtiani, Learned Senior Advocate representing the Petitioner has made the following submissions : 11.1. That after the Order dated 6\" March, 2020 was passed, this Court granted multiple opportunities to Respondent No. 4 to comply with its Orders. Respondent No. 4 not only failed to comply with the said Orders but also made false and incorrect statements in the said four Disclosure Affidavits in order to mislead this Court thereby obstructing the administration of justice and delaying the hearing of this Writ Petition for grant of urgent interim reliefs. 11.2. That the following instances clearly show that Respondent No. 4 has disobeyed the Orders passed by this Court and made false and incorrect statements during the hearing of the present Writ Petition, to mislead the Court: 11.2.1. In its 1* Disclosure Affidavit, despite this Court specifically directing Respondent No. 4 to disclose all assets of Respondent No. 4 and its group entities, Respondent No. 4 only disclosed details in respect of its project ‘Marvel Ribera’. Respondent No. 4 knowing fully well that this was not the only project and/or asset of Respondent No. 4 and its group entities, made a false statement that other than the said project Marvel Ribera, it had no other assets. He submitted that filing of three more Affidavits thereafter by Respondent No. 4 itself shows that the aforesaid statement was false and was made willfully and deliberately in order to mislead this Court at the first instance. 11.2.2. In the 4\" Disclosure Affidavit, Respondent No. 4 has sought to justify its 1“ Disclosure Affidavit by stating that it did not disclose other assets because it was under the impression that disclosure in respect of the project Marvel Ribera and the assets in the said project would be “sufficient” so as to comply with the Order passed by this Court. The 1* Disclosure Affidavit clearly stated that out of 27 flats, 11 had been sold and 16 unsold units were mortgaged. Further it was also stated in the said Affidavit that a sum of Rs. 18,54,05,681/- was receivable from the purchasers of the sold units, but when at the hearing on 14\" January, 2021, this Court enquired whether the said amount had been received, Respondent No. 4’s answer was in the negative. In the aforesaid circumstances, Respondent No. 4 could never have been under the belief that the assets disclosed in the 1* Disclosure were sufficient. 11.2.3. The first three Affidavits filed by Respondent No. 4 only disclosed limited entities and projects and sought to represent to this Court that these were the only entities and projects of Respondent No. 4 and its group entities. However, after the Petitioner pointed out in its Affidavit dated 9\" February, 2021 that Respondent No. 4 had not disclosed various other entities and projects, Respondent No. 4 in the 4\" Disclosure Affidavit admitted that it had disclosed only “major” entities and projects of Respondent No. 4 and its group entities as disclosure with respect to others was “irrelevant”. 11.2.4. In the 4\" Disclosure Affidavit, Respondent No. 4 has stated that it did not disclose assets of projects Marvel Orial, Marvel Fria, Marvel Piazza as the same are “completed” projects. The said statement is belied by the fact that Respondent No. 4 on its official website has represented that these three projects, are ‘ongoing’ projects of Respondent No. 4. 11.2.5. In the 4\" Disclosure Affidavit, Respondent No. 4 has stated that it did not disclose the group entities Marvel Precast Structures India LLP and Marvel Ora Residences LLP as they are not operational. This statement of Respondent No. 4 is belied by the financial statements of these entities produced by the Petitioner which clearly show that in the Financial Year 2019-2020 one of the LLP’s has advanced loan amounts of approximately Rs. 60 crores to its related parties. That it again begs the question how these entities had money to advance such huge loans if they were not operational. 11.3. That these acts of Respondent No. 4 and of Shri Jhavar, in repeatedly disobeying the aforesaid Orders and willfully breaching the undertakings given by it to this Court, amounts to civil contempt, for which the Petitioner may initiate separate proceedings. In addition thereto, the acts of Respondent No. 4 and Shri Jhavar in repeatedly making false and incorrect statements on oath before this Court, in order to interfere with and obstruct the administration of justice, also amounts to contempt in face of the court, as well as perjury. In view thereof, he submitted that Respondent No. 4 and Shri Jhavar ought to be held guilty of contempt and detained in custody. 11.4. That the above submissions are fortified by the Judgment in   5895 - Paras 1 to 22 and 27, wherein a Learned Single Judge of this Court ordered civil imprisonment of the Defendant for a period of three months in view of the Defendant’s deliberate, willful, contumacious conduct in disobeying the Orders passed by the Court, by making false and incorrect statements on oath, thereby obstructing the administration of justice. That like the facts of the present case, in Cipla Limited, supra, the defendant being a Judgment Debtor had been directed by this Court to disclose on oath all his assets (movable and immovable). The defendant filed four successive Affidavits to disclose its assets and in each of the Affidavits, suppressed its assets and did not provide a complete disclosure. In view thereof, this Court held that as the defendant had made false and incorrect statements to the Court, the defendant was guilty of having committed grave and serious act of contempt of this Court. This Order and Judgment was challenged by the Defendant before the Division Bench of this Court in Commercial Appeal No. 18 of 2016. The Division Bench by its Order dated 19 December 2017 Mr.   No. 18 of 2016) - Rel Paras 24, 29 to 37 dismissed the Appeal and upheld the Judgment passed by the Single Judge. The Defendant then challenged the said Order dated 19\" December 2017 by filing SLP (Civil) No. 3872 of 2018 before the Supreme Court. The Supreme Court also dismissed the said SLP on 19\" February, 2018 Mr. Krishna Dushyant Rana vs. Cipla Limited - SLP No. 3872 of 2018 and upheld the Order passed by the Single Judge and the Appeal Court. 12. Shri Amit Gharte, Learned Advocate representing Respondent No. 4 made the following submissions : 12.1. That the Petitioner’s contention that Respondent No. 4 has not disclosed its assets and of its group entities is incorrect. 12.2. That when the said Order dated 6 March, 2020 was passed, Respondent No. 4 immediately filed the 1* Disclosure Affidavit disclosing the assets in respect of the project ‘Marvel Ribera’. 12.3. That the said Affidavit was filed under a bona fide belief that as the subject amount involved in the present Writ Petition was approximately Rs. 14,00,00,000/, the said Disclosure that Respondent No. 4 is to receive approximately Rs. 18,00,00,000/- in the said Project from 11 sold flats, would be a sufficient disclosure for the amount involved in the present Writ Petition. 12.4. That on the next occasion i.e. 14\" January, 2021, when it was informed that a detailed disclosure needs to be filed by Respondent No. 4, Respondent No. 4 immediately filed its 2’ Disclosure Affidavit on 20\" January, 2021, which included the chart as to the number of projects and the loans outstanding against the Respondent No. 4 and its group entities. 12.5. That thereafter vide the 3\" and 4\" Disclosure Affidavits, the Respondent No. 4 has in detail disclosed the assets, liabilities, flats sold and unsold, bank details of Respondent No. 4 and its group entities. 12.6. That therefore Respondent No. 4 has to the best of its ability made every effort to comply with the Orders of Disclosures and therefore cannot be held guilty of contempt. 12.7. That it is not the case of any party that the said disclosures filed on record are false or misrepresenting. 12.8. That Respondent No. 4 has not committed any ‘wilful’ breach of any undertaking or statement given to this Court and therefore no contempt action can be initiated against Respondent No. 4. 12.9. That the Supreme Court has in its Judgment in the case of    , inter alia held that a mere disobedience of an order may not be sufficient to amount to a civil contempt within the meaning of Section 2(b) of the Contempt of Courts Act, 1971. The element of willingness is an indispensable requirement to bring home the charge within the meaning of the Contempt Act. 12.10. That if the Petitioner is aggrieved by non-disclosure of complete assets of Respondent No. 4, which according to the Respondent No. 4 has been disclosed, the Petitioner instead of seeking a contempt action, ought to have sought for enforcement of the said Order. That in the case of   (  - Para 18, the Supreme Court has held that for enforcement of the interim and final orders / decree of courts, including undertaking given to the Court, a proper and advisable first mode for enforcement of the order is to file an application seeking enforcement of interim order / undertaking given to the Court, rather than filing a contempt proceeding seeking contempt action. When the matters relate to infringement of a decree or decretal order embodying rights between the parties, contempt jurisdiction cannot be invoked merely because the other remedy would take time; further the contempt jurisdiction is attracted when disobedience of Court’s order or undertaking to the Court is wilful and contumacious (see part C of the Written Arguments of Respondent No. 4). 12.11. That the Supreme Court in   ( , has held that contempt action cannot be used for enforcement of money decree or directions/order for payment of money. That the said principles are also applicable in the facts of the present case and under the garb of contempt proceedings, the enforcement of money decree cannot be ordered. 12.12. That the Petitioner has failed to file any proceedings including contempt proceedings against Respondent No. 4. That neither have the contempt proceedings been preferred, nor this Court has taken suo motu cognizance of any such contempt. Further, no contempt notice has been issued or a show cause notice prior to such contempt notice has been issued to Respondent No. 4 stating the charges and/ or contentions which the present Respondent No. 4 needs to answer. 12.13. That Respondent No. 4 is unaware on what grounds/charges the Petitioner is seeking contempt action against them. That without anything on record / on affidavit, as to under what circumstances and on what grounds the Petitioner is seeking contempt action against Respondent No. 4, the Petitioner cannot merely rely upon a Judgment passed in Cipla Lid.(supra) to seek contempt action. In any event the Judgment in Cipla Lid. arises out of a Summary Suit, which was pending on the Original Side of this Court and the Single Judge was exercising the powers of the Civil Court. Further in paragraph 12, the Single Judge has specifically held that the Defendant had filed a false affidavit and made false statement before the Court, which resulted in the contempt action. That this Court is not exercising jurisdiction of a civil court in its original jurisdiction and the present proceedings are under Article 226 and therefore no contempt proceedings will lie. 12.14. That Chapter XXXIV of the Bombay High Court Rules, Appellate Side, regulates the procedure for initiating contempt action under Article 215 of the Constitution of India and the Contempt of Courts Act, 1971. Rules 8, 9, 10, 22 and 24 of the said Rules makes it clear that the reliefs sought by the Petitioner for holding Respondent No. 4 guilty of contempt cannot be granted znter alia unless the Petitioner files a separate application for disobedience of order by Respondent No. 4; a notice is issued to the contemnor by this Court calling upon the contemnor to show cause why no action should be taken against him and Respondent No. 4 is granted 14 days to reply to such Notice. 13. Shri Jagtiani, in rejoinder, submits that the aforesaid Judgment in Anil Sarkar (supra) relied upon by Respondent No. 4 does not support the Respondent No. 4’s contention, as the question whether the disobedience of the order was willful or not is required to be ascertained on the basis of facts of each case. He also submitted that by the Judgments in the case of Kanwar Singh (supra) and Food Corporation of India (supra), the Supreme Court held that contempt jurisdiction cannot be used for enforcement of decree passed in a civil suit as the person had initiated proceedings under Order 39 Rule 2A of the Code of Civil Procedure for breach of a decree, instead of filing execution proceedings under Order 21 Rule 32 of CPC. He submitted that the said ratio is not applicable to the facts in the present case as the Petitioner is not seeking contempt for non-compliance of the decree at all. 13.1. Shri Jagtiani also submitted that the fulfillment of Rules 8, 10, 22 and 24 of the Appellate Side Rules, as relied upon by Respondent No. 4 are not necessary when the contempt is committed in the face of the Court. Shri Jagtiani relied upon Section 14(1) of the Contempt Act read with Rule 4 of the Appellate Side Rules which deal with contempt in the face of the court. ISSUE NO. 2 AS SET OUT IN PARAGRAPH 7.2 14. Shri Sharan Jagtiani, Learned Senior Advocate representing the Petitioner has made the following submissions : 14.1. That in the present case, the Collector and Tahsildar have completely failed to discharge their statutory duties and exercise powers conferred on them under the Maharashtra Land Revenue Code, 1966 (“the Code’) to execute the said Recovery Certificate. That despite receiving the direction from RERA on 15\" April, 2019 to execute the Recovery Certificate, the Tahsildar sent demand notices to Respondent No. 4 only on 11\" September, 2019 and then on 10\" January, 2021, which Respondent No. 4 failed to comply with. Thereafter, the Tahsildar carried out a search of Respondent No. 4’s properties from the property cards available with her. According to the Tahsildar, the Property Cards disclosed names of certain properties in the name of Marvel Imperial Co-operative Housing Society Limited, Marvel Crest Condominium, etc. However, as the names on these Property Cards were not the same as that of Respondent No. 4, i.e. ‘Marvel Sigma Homes Pvt. Ltd.’, she was unable to execute the said Recovery Certificate. That the Property Card annexed, itself shows that Marvel Crest Condominium is owned by Respondent No. 4, which the Tahsildar failed to consider. That instead of exercising the powers conferred on revenue officers under the Code to execute a Recovery Certificate, the Tahsildar vide her Letter dated 11° March, 2020 informed RERA that as she could not locate the properties of Respondent No. 4, she was unable to execute the Recovery Certificate. Thus, it is clear that there has been complete inaction by the Collector and the Tahsildar in complying with their statutory obligations. 14.2. That the events that have transpired during the hearing of the present Writ Petition, clearly show that Respondent No. 4 has no intention of complying with the said Recovery Certificate and/or of paying the said Decretal Amount. That Respondent No. 4 has made every attempt to delay the payment of the said Decretal Amount to the Petitioner. Initially, Respondent No. 4 did not comply with the demand notices of the Tahsildar. Thereafter, once the present Writ Petition was filed, Respondent No. 4 in order to delay the hearing of the present Writ Petition did not provide complete disclosure of its assets and that of its group entities, despite repeated orders passed by this Court. 14.3. That in the various Disclosure Affidavits filed by Respondent No. 4, Respondent No. 4 has sought to represent to this Court that it was debt ridden and had no means to pay the dues of the Petitioner. However, from a perusal of these Disclosure Affidavits, the Petitioner has been able to ascertain that at least an amount of Rs. 2,90,15,211.69/- (Rupees Two Cores Ninety Lakhs Fifteen Thousand Two Hundred Eleven and Sixty-Nine Paisa) is lying in the bank accounts of Respondent No. 4 and its group entities which have no charge on it. There are various other bank accounts as well, which have not been disclosed by Respondent No. 4 and which may also have monies lying therein, which are free of any charge / lien. That as per the list of sold and unsold units in various projects disclosed by Respondent No. 4, there are 192 unsold units in the projects owned by Respondent No. 4 and approximately 449 unsold units in the various projects owned by the group entities of Respondent No. 4. Further, group entities of Respondent No. 4 has been advancing monies to the tune of Rs.60 crores to its related entities, which clearly show that Respondent No. 4 and its group entities have the required funds to pay the Decretal Amount but is with malafide intention avoiding to pay the same. In view thereof, he submitted that Respondent No. 4 despite having the means to pay the said Decretal Amount was refusing to pay the same to the Petitioner. 14.4. That the Supreme Court by its Order dated 12 February, 2021 passed in SLP (C) No. 2122-2123 of 2021, has already upheld the approach of this Court in ensuring that in one manner or the other the Respondent No. 4 honours the decree which has been passed against it. That in view of the aforesaid Order, the interim reliefs as sought by the Petitioner ought to be granted. 14.5. That prayer clauses b (ii) and b (ili) ought to be granted. That the Petitioner apprehends that if the aforesaid interim reliefs are not granted, Respondent No. 4 may deal with all its assets in order to deprive the Petitioner of its undisputed dues. That the ratio laid down by the Supreme Court in the case of     - Paras 10 t013 in support of the necessity for grant of interim reliefs in a Writ Petition keeping in mind the ends of justice, is squarely applicable to the facts and circumstances of the present case, more particularly to the conduct of Respondent No. 4 in the present case. 14.6. That in exercise of its inherent powers under Article 226 of the Constitution of India, this Court has the jurisdiction to pass orders and/or directions against a private person and in the present case against Respondent No. 4, which is a Private Limited Company. That the Allahabad High Court in the case of  . Act & Ors.   All 38 - Paras 10 to 18 has held that a High Court, while being seized of a writ petition under Article 226 of the Constitution, can also pass any order including an order in the nature of an injunction against a private person in exercise of its inherent powers. That while arriving at the aforesaid finding, the Allahabad High Court has relied upon the Judgment of the Supreme Court in     (Coram: K. SUBBA RAO, J.C. SHAH AND S.M. SIKRI, JJ.), wherein the Supreme Court, while considering the scope and ambit of the powers of the High Court under Article 226 of the Constitution, held that the High Court while exercising its writ jurisdiction can issue any order or direction, which it considers necessary to be issued. 15. Shri Amit Gharte, Learned Advocate representing Respondent No. 4, has made the following submissions : 15.1. That Respondent No. 4 is a Private Limited Company registered under the Companies Act, 1956 and does not perform a public function and further does not discharge any public duty and therefore Article 226 of the Constitution of India and the Writ Of Mandamus and/ or any other writ or order or directions cannot be invoked or passed against Respondent No. 4. 15.2. That Respondent No. 4 is governed by RERA and therefore the grievance or action, if any, against Respondent No. 4 has to be within the frame work of RERA. 15.3. The Supreme Court, in its Judgment in the case of   2001 1 SCC 298 - Para 8 and 11, has held that Article 226 can be invoked only when the authority or person performs a public function, or discharges a public duty and not against a private person. 15.4. That the Judgment in Shri Ram Singh (supra) relied upon by the Petitioner is not applicable to the facts of the present case as the same does not specifically deal with issuance of the Writ of Mandamus against a private limited company. 15.5. That interim reliefs sought by the Petitioner will severely affect the projects of the Marvel Group and that the Marvel Group and Respondent No. 4 would be agreeable to the Petitioner selling off the Flat agreed to be purchased by the Petitioner and to retain the sale proceeds in satisfaction of the Recovery Certificate. 16. Shri Jagtiani has distinguished the Judgment relied upon by the Respondent No. 4 in VST Industries (supra) and submitted that the said Judgment relied upon by the Respondent No. 4 has no application in a situation where the final relief is undoubtedly directed against a statutory authority that is a part of the ‘State’ and in aid of that, interim relief is directed against a private party that has benefitted from the inaction of the statutory authority. He submitted that in the present case the Petitioner has not sought issuance of a Writ against the Respondent No. 4, which is a Private Limited Company. 16.1. Without prejudice to the aforesaid, Shri Jagtiani submitted that the said Judgment in VST Industries (supra) does not consider the judgment of the Supreme Court in Dwarka Nath (supra) and is therefore per ncuriam, or at any rate, cannot be relied upon to defeat the grant of interim reliefs. FINDINGS AND CONCLUSIONS : ISSUE NO. 1: “Whether Respondent No. 4 and its Director Shri Jhavar have interfered with the administration of justice by filing false and incorrect affidavits of disclosure and by also violating and breaching various orders of this Court?; If so, the consequences of such breach?” 17.1. The liability of the Respondent No. 4 under the Recovery Certificate is not in dispute. The Recovery Certificate has attained finality. The amount owed to the Petitioner is a repayment of the amount already paid by the Petitioner to Respondent No. 4 for purchase of a flat in its project, and interest on that amount as ordered by the Adjudicating Officer. Thus, the Orders of Disclosure against Respondent No. 4 are a step-in aid of the recovery of this amount, which is sought for in the above Petition filed against Respondent Nos. 2 and 3 for failure to discharge their statutory duties in relating to realising the amount due under the Recovery Certificate. 17.2. Having set out and considered the various Orders and the Affidavits of Disclosure filed by Respondent No. 4, as also the Affidavit of the Petitioner commenting on the lack of disclosure, and having also considered the submissions of both sides on this aspect, we have no hesitation in concluding that Respondent No. 4 and its Director, Shri Jhavar, have wilfully and deliberately breached the Courts Orders. Not only is this a case of wilful disobedience of our Orders but in the facts of this case, such wilful non-compliance and false and incomplete affidavits also tend to interfere with the administration of justice, as these disclosures are necessary to enable us to pass effective orders in the Writ Petition. 17.3. The fact that Respondent No. 4 has filed four Affidavits of Disclosure, all of them in purported compliance of this Court’s Order dated 6\" March, 2020 (and reiterated by the Order of 14° January, 2021), itself indicates that the first three Affidavits, even according to Respondent No. 4, were inadequate and non-compliant. What is relevant to note is the casual manner, in which these Affidavits have been filed in brazen disregard to what was stated in the Orders. For instance, in the 1* Disclosure Affidavit, Respondent No. 4 has only given details of one of the projects of Respondent No. 4, i.e. the subject project ‘Marvel Ribera’. The purported disclosure made qua the subject project was that out of the total 27 flats, 11 flats have been sold and an amount of Rs. 18,54,05,681 was receivable towards sale consideration of the said flats. The remaining 16 flats are unsold, but were mortgaged to ICICI Home Finance Ltd., under a Mortgage Deed dated 29\" May, 2017. Further in paragraph 7 of the 1° Disclosure Affidavit, Respondent No. 4 made a statement that, “Marvel Sigma Homes Private Limited apart from above has no other property”. Details of other projects of Respondent No. 4 or of any of the group entities were not disclosed. In the 4\" Disclosure Affidavit, at paragraph 2, there is an attempt to justify this by saying that details of other projects were not disclosed since Respondent No. 4 was under the impression that the amount of assets including receivables disclosed by Respondent No. 4 in the 1* Disclosure Affidavit would be sufficient to comply with the Court’s Order dated 6\" March, 2020 (wrongly referred to as 4\" March, 2020). 17.4. The above stand of Respondent No. 4 is belied by the fact that after the 1“ Disclosure Affidavit was filed, in response to the Court’s query as to realisation of the receivable of Rs. 18,54,05,681/-, Respondent No. 4 told the Court that this amount has not been received and no indication was given as to when this amount would in fact be received. In fact, no particulars of this substantial amount of receivables were disclosed in any of the later Affidavits especially when the 4 and last Disclosure Affidavit was filed on 12\" February, 2021 and the 1“ Disclosure Affidavit was filed on 12\" March, 2020. Despite this, Respondent No. 4 seeks to justify its breach in the 1* Disclosure Affidavit by suggesting that what was disclosed was sufficient. That apart, the determination of whether a disclosure is sufficient or not, is not to be made by the party who is ordered to make disclosures by the Court-when the terms of the Order seeking disclosure are clear and categorical. Thus, the conduct of wilful breach and obstruction commenced with the 1* Disclosure Affidavit which was sought to be justified by the Respondent No. 4 even after about a year, by which time the Respondent No. 4 was obviously aware that the Court was not satisfied with the disclosures made. 17.5. The conduct of Respondent No. 4 in not taking responsibility to ensure full compliance with our Orders stood exposed from the statement made in the 3™ Disclosure Affidavit namely, “J say that since the Respondent No. 4 and its other companies are vast, there might be some of the assets/ projects, which inadvertently are not stated in the Affidavits, the Respondent No. 4 crave leave of Hon’ble Court to put the said properties on affidavits if the same is pointed out to us.” (Emphasis Supplied) 17.6. We are therefore of the view that such an Affidavit is unacceptable and a clear indication that Respondent No. 4 had no intention to make serious efforts to comply with our Orders as noted above. In fact, as the 4\" Disclosure Affidavit demonstrates, the reason for not making full disclosures in the earlier Affidavits is not because Respondent No. 4 or its Director could not access details of Respondent No. 4’s projects and assets of those of its group entities, but because Respondent No. 4 and Shri Jhavar only chose to make disclosure of assets of “major” entities and projects that they regarded as relevant. This is in complete breach of our Orders, which are clear and unqualified qua the disclosure that was required to be made. 17.7. We are also in agreement with the submission of the Petitioner that the false and incomplete disclosures up to the filing of the 3 Disclosure Affidavit have been highlighted in the Petitioner’s Affidavit dated 9 February, 2021. The contents and submissions in relation to this Affidavit of 9°\" February, 2021 have been set out and discussed in the foregoing paragraphs and the same are therefore not reproduced herein. However, it is pertinent to note that up to the filing of the 3\" Disclosure Affidavit, the disclosures of various group entities had not been made. Some of those group entities appear to be developing ongoing projects. In other instances, they have completed projects, and would therefore in all probability have unsold inventory. Other group entities, such as Marvel Precast Structures LLP and Marvel Ora Residences LLP, appear to have assets in the form of receivables of loans advanced by them. In the case of Marvel Ora Residences, the amount loaned by it is substantial, being about Rs. 59.99 crores. This disclosure is relevant since it indicates that the group entities have funds and resources or access to funds and resources which are being used to finance other group entities rather than the Marvel Group discharging its liability to persons such as the Petitioner. At this stage, however, what is more important to note is the fact that these disclosures were never made by the Respondent No. 4 and were brought to light by the Petitioner in its Affidavit of 9\" February, 2021. 17.8. The other important aspect of the non-disclosure is what is set out in paragraphs 26 and 27 of the Petitioner’s Affidavit dated 9\" February, 2021. This is in relation to various projects that have not been disclosed, including those of the seven entities in respect of which some disclosure was made by Respondent No. 4. The details of these projects have already been listed above. The Petitioner has relied upon the Website of the Marvel Group being available at the url: www.marvelrealtors.com. The Petitioner has then also placed on record the entities and projects in relation to which no bank account details and disclosures have been made. 17.9. Respondent No. 4 has attempted to justify its non-disclosures in its 4\" Disclosure Affidavit dated 12\" February, 2021, the contents of which have also been set out above. In paragraph 3, Respondent No. 4 has stated that the non-disclosure of bank account details of various projects is because most of the projects are complete. A list of those supposedly completed projects is then given. The fact that a project is complete is no reason to not disclose it. It is possible that even for a complete project, there may be unsold inventory and the bank accounts maintained would be a relevant part of any disclosure. 17.10. Moreover, the Petitioner has correctly pointed out by relying upon the Website of the Marvel Group that certain projects namely, Marvel Orial, Marvel Fria, Marvel Piazza and Marvel Selva Ridge, are in fact ongoing projects and not ‘complete’. The relevant extracts of the Website of the Respondent No. 4 / the Marvel group are reproduced below : IMAGE Thus, it can be seen that the statements made by Respondent No. 4 are clearly false to its own knowledge and contrary to the information that Respondent No. 4 is providing to the public at large in relation to its own business. 17.11. We are also of the view that the reason for not filing disclosure of the entities mentioned in paragraph 4 of the 4 Disclosure Affidavit, by describing it as irrelevant, because disclosure of major group entities had been made, is wholly untenable. As has been noted above, the Petitioner’s response to this part of Respondent No. 4’s Affidavit also establishes that at least some of those entities had assets or unsold inventory that were substantial and had to be disclosed. We reiterate that it is not for Respondent No. 4 to unilaterally decide what is relevant and irrelevant in complying with an Order of Disclosure. As already pointed out, the current assets (including receivables from the short-term loans advanced) of Marvel Ora Residences LLP are very substantial and clearly indicate that the Marvel Group has access to funds, the source of which is not being disclosed. As noted in the context of the Petitioner’s Affidavit of 9\" February, 2021, even some of the other group entities have assets, which Respondent No. 4 never disclosed, because it described them as ‘irrelevant’ and outside the category of ‘major’ entities. 17.12. In view of what is set out above, it would be relevant to set out the observations of a Single Judge of this Court in C7pla Limited, (supra). “1. This is one of those matters where the court is anguished with the conduct of the defendant who despite being given repeated opportunity has repeatedly abused the liberty granted by the court. It is rather unfortunate that the defendant, who ts probably in his 30's at least from the appearance, if let off to continue with his behaviour, it will erode the faith that the public have on judiciary. The rule of law is premised upon the faith reposed by the people in the justice delivery system. To prevent erosion of that faith contemptuous behaviour in the face of the court needs a strict treatment. 18. The defendant has made false and incorrect statements and has given undertaking to this Court that he has disclosed every asset that he has, knowing the same to be false and incorrect. I am satisfied that the defendant is guilty of having committed grave and serious act of contempt of this Court. This court gave a very long rope to the defendant to come out clean, to come out honest, to come out truthful and be transparent to the court but every opportunity given has been abused by the defendant. Repeatedly false statements have been made. The attempt ts to drag on the matter so that the defendant can get away. The conduct of the defendant has scandalized and lowered the dignity of the court in the eyes of the public. The action of the defendant has been deliberate, unlawful and purposely done with a view to mislead the court, by making deliberate, false, misleading and incorrect statements. In Advocate General, High Court of Karnataka v. Chidambara, the Karnataka High Court has also held that any person who makes a false statement on oath would be interferring with the administration of justice. 19. The Hon'ble Supreme Court of India in the case of Re: Bineet Kumar Sing v. Unknown has in clear terms held that a false or misleading or wrong statement deliberately and willfully made by a party to the proceedings would undoubtedly tantamount to interference with the due course of judicial proceeding. 20. Inthe present case the conduct of the defendant clearly brings to light the fact that the defendant has no respect for this Court. It clearly shows that the defendant feels that making false statements including undertaking to the courts and thereafter breaching them or not complying with the directions given by the Court would have no consequences. The conduct of the defendant is willful, deliberate and contumacious. The Supreme Court in Leela David ». State of Maharashtra, in clear terms that the court is not precluded from taking recourse to summary proceeding when a deliberate contempt takes place and the punishment is given forthwith by the court on holding the contumacious guilt of contempt and sending them to prison. 21. In   it is stated the law should not be seen to sit by limply, while those who defy it go free, and those who seek its protection lose hope. It is also settled that a course of conduct which abuses and makes a mockery of the judicial process and which thus extends its pernicious influence beyond the parties to the action and affects the interest of the public in the administration of justice needs a strict treatment. 22. The defendant has made a mockery of the judicial process. A decree has been passed against the defendant way back in 2011. The chamber summons was taken out for the reliefs as mentioned above. Even though the chamber summons was served upon the defendant in September-2013, the defendant did not file any reply until June-2015. Even in the affidavit in reply, t.e., first affidavit, he does not disclose the entire truth about all the assets in his name. Still he states in the end of the affidavit that he has disclosed everything. When he was given another chance to explain, he files second affidavit in which, again, he does not disclose all the assets but still makes a statement that he has disclosed all movable and immovable assets to the court. But when the annual returns which were annexed to the second affidavit was considered, it came to light that he had other assets in his name which have not been disclosed in his affidavit. 3rd opportunity and 4th opportunity was given to the defendant and he filed third affidavit dated 13.7.2015 and fourth affidavit dated 8.9.2015 but still chose to be economical with truth. When the court asked him as to how he paid the loan taken for the two skoda cars, the defendant's counsel on instructions from the defendant stated first it was paid by cash and then it was changed to one car in cash and other in cheque and again it was changed to everything by cheque from Cosmos bank, but there is no mention of Cosmos bank in any of the documents. At every stage whenever affidavits were filed, the defendant was made aware that he should be truthful in his affidavit. The defendant was also aware that he had to disclose all the assets and that is why in the affidavits he has been signing off by saying ‘I disclosed my all movable and immovable assets’. He had stated that right in the first affidavit. If that was true, there would not have been a need to file the second affidavit in which also he has stated he has disclosed all assets. But still he had to file third and fourth affidavit. Therefore, the defendant knew all the time that he was making false statement before the court in the form of affidavits and in effect was making a mockery of the judicial process. The opportunity given to file further affidavit was misused and abused. The conduct of the defendant was contumacious because he could not care. His demeanor has been that he could make false statements, give undertakings to the court and breach them and it would have no consequences. The action of the defendant has been deliberate, willful and purposely done with a view to completely mislead this court. By making false statement on oath, knowing it to be false statement, the defendant has interfered with the administration of justice. In my view, tf this conduct of the defendant is not dealt with firmly, that may result in scandalizing the institution and lowering its dignity in the eyes of the public. 25. In view of the above, I hold the defendant has disobeyed the orders made under Order XXTI Rule 41(2) of the code of civil procedure. 27. In view of the deliberate willful contumacious conduct of the defendant and thereby obstructing the administration of justice, the defendant deserves to be detained in civil prison for three months, the maximum period provided.” 17.13. As mentioned above, the Order and Judgment of the Single Judge was confirmed by a Division Bench and thereafter by the Supreme Court. Although, the Judgment in C7pla (supra) was in the context of consequences of non-disclosure under Order 21 Rule 41(3) of the Code of Civil Procedure, 1908 (‘CPC’), the Judgment itself also relies upon the general principles that are fundamental to the rule of law. The Judgment (which in turn refers to various other relevant decisions of the Supreme Court and other Courts) clearly supports the proposition that such brazen and continuous disregard for orders of the Court including by making false and misleading statements would also obstruct and interfere with the administration of justice. This entitles the Court in a given case to take recourse to summary proceedings when a deliberate contempt takes place and the punishment is given forthwith by the Court. 17.14. We are in agreement with the views expressed in C7pla (supra). We also find that the Judgments relied upon by the Respondent No. 4 in the case of Anil Sarkar (supra) is of no relevance and renders no assistance to Respondent No. 4. For the reasons noted above, we find that the breach and non-compliance of our Orders by Respondent No. 4 was indeed wilful and deliberate and did affect the administration of justice. It was not a case where there was one infraction and thereafter Respondent No. 4 complied with our Orders. 17.15. The Judgments in Kanwar Singh Saini (supra) and Food Corporation of India (supra) relied upon by the Respondent No. 4 to contend that the Court ought to exercise discretion when exercising powers under the Contempt of Courts Act and that the contempt jurisdiction ought not to be used for enforcement of a decree where proceedings in enforcement have been initiated, are equally of no assistance to the Respondent No. 4. 17.16. Although these are not proceedings under the Contempt of Courts Act, it would be entirely within the jurisdiction and power of this Court under Article 226 of the Constitution of India, to deal with the very serious issue of Respondent No. 4’s wilful disobedience and interference in the administration of justice by deliberately not complying with the various Orders of Disclosure made by this Court from time to time, and by filing false and incomplete Affidavits. As regards the exercise of discretion, before taking such action, we may note that we have given several opportunities to Respondent No. 4 to comply with our Orders. There is also no merit in the submission that contempt proceedings are not a substitute for proceedings for execution or enforcement. This submission is of no relevance in the present case, where the grievance of the Petitioner is that the statutory authorities are taking no steps to ensure recovery of the amounts under the Recovery Certificate, because of which the present Petition has been filed. The issue of Respondent No. 4’s wilful breach and interference with the administration of justice has come up because of its conduct, in the course of this very Writ Petition. Thus, there is absolutely no merit in the submission of Respondent No. 4 by relying on the above Judgments. 17.17. This takes us to the question as to what action ought to be taken against Respondent No. 4 and its Director Shri Jhavar, who, being an executive Director of Respondent No. 4, has affirmed all the Affidavits of Respondent No. 4. Though we would have been justified in forthwith considering Shri Jhavar’s conduct as being interference in the administration of justice for all the reasons noted above, we are instead inclined to take suo moto cognizance of Respondent No. 4 and Shri Jhavar’s conduct, and direct that a Notice be issued to Respondent No. 4 and Shri Jhavar under Section 14 of the Contempt of Courts Act read with Rule 4 of the Appellate Side Rules, 1960, and call upon Respondent No. 4 and Shri Jhavar to respond as to why Shri Jhavar should not be punished under the aforesaid provisions for obstruction and interference with the administration of justice and lowering the dignity of this Court. Such Notice will be issued by the Appellate Side Registry of the Bombay High Court. All proceedings in relation to such Notice will be in accordance with the provisions of the Contempt of Courts Act and the Appellate Side Rules. Our observations as above may be considered relevant only for the purposes of our decision to take suo moto cognizance and for issuance of the said Notice to Respondent No. 4 and Shri Jhavar. 17.18. Independent of the above, the Petitioner will be at liberty to institute proceedings for civil contempt under the provisions of the Contempt of Courts Act, if so advised. 17.19. For all of the above reasons we answer the first issue as set out above in the affirmative and the consequences of our conclusion are as set out hereinabove. ISSUE NO. 2 : Whether the Petitioner is entitled to the interim reliefs as set out in prayer clauses (b)(ii) and (b)(ili) of the present Writ Petition, especially considering that Respondent No. 4 is a Private Limited Company? 18. As regards grant of interim reliefs prayed for, the following two questions arise for our consideration : \"i) whether a prima facie case has been made out against Respondent Nos. 2 and 3 for non-performance of their statutory duties under the Maharashtra Land Revenue Code, for realisation and recovery of the amount under the Recovery Certificate; ii) whether Respondent No. 4, being a Private Limited Company, can be subjected to interim reliefs in exercise of our writ jurisdiction under Article 226 of the Constitution of India.\" 18.1. Having considered the material on record, we are prima facie satisfied, that Respondent Nos. 2 and 3 have done nothing in discharge of their statutory duties to secure recovery of the Decretal Amounts under the Recovery Certificate. Although the Tahsildar issued a demand notice dated 11\" September, 2019, no steps were taken especially considering that Respondent No. 4 did not reply to the notice. There are powers available to the Tahsildar under the provisions of the Maharashtra Land Revenue Code, inter alia under Section 263 and Section 267 read with Rule 17 of the Maharashtra Realisation of Land Revenue Rules, 1967, to facilitate such recovery. No steps were taken pursuant to the powers available under these provisions. The Tahsildar did absolutely nothing thereafter, despite the Petitioner addressing letters to the Tahsildar to take steps for making the recovery under the Recovery Certificate. 18.2. The Affidavit filed by Respondent No. 3 - Tahsildar dated 6\" March, 2020 is itself an indication that there was complete and unjustified inaction on her part. We have already reproduced hereinabove paragraphs 6 and 7 of this Affidavit. The stand of the Tahsildar essentially is that since in the Property Card there is no project or property that bears the name of Respondent No. 4, no action for recovery could be taken. In fact, the Property Card annexed to the Affidavit of 6 March, 2020 itself indicates that Marvel Crest is a project of Respondent No. 4 - Marvel Sigma Homes Pvt. Ltd. Despite this, no steps were taken by the Tahsildar even in respect of the project Marvel Crest. This shows a complete lack of effort and application of mind by the office of Tahsildar in discharging its statutory duty. 18.3. It is pertinent to note that after filing the Affidavit dated 6\" March, 2020, the Tahsildar addressed a letter to RERA on 11\" March, 2020 that she could not locate the properties of Respondent No. 4 and was unable to execute the Recovery Certificate. We have already referred to this letter above. The same establishes complete failure and abdication of duties by the Tahsildar. In fact, as on the date of writing this letter, the Tahsildar had done nothing to secure the execution and realisation of monies due under the Recovery Certificate. This letter is yet another indication that the Tahsildar was not interested in ensuring realisation of the amount under the Recovery Certificate. 18.4. Respondent No. 4 contended that Respondent Nos. 2 and 3 are now taking steps and that the Tahsildar has, on 8\" February, 2021, levied a charge on Respondent No. 4’s property for Rs. 6.25 crores at 30/A Boat Club Road Pune. We find that this solitary measure during the pendency of the Writ Petition, and that too after gross inaction and abdication of duty, is not enough to satisfy us that Respondent Nos. 2 and 3 are taking the necessary steps in accordance with law. It is not the contention of Respondent Nos. 2 and 3 that the Petition ought to be dismissed in view of the steps taken by them. Their Affidavit on record shows that they have pleaded helplessness in ensuring recovery of the amounts due under the Recovery Certificate. It is not for Respondent No. 4 to make a self-serving submission that the actions taken by Respondent Nos. 2 and 3 against Respondent No. 4 itself are enough to satisfy this Court. For these reasons, we find that a strong prima facie case has been made out in this Writ Petition to consider the grant of interim reliefs. 18.5. The next aspect that requires consideration is the contention of Respondent No. 4 that being a Private Limited Company or entity, no reliefs can be granted against it in a Writ Petition under Article 226 of the Constitution of India. This submission has been made in the Written Submissions filed on behalf of Respondent No. 4. Much after the application for interim reliefs was reserved for Orders, Respondent No. 4 filed yet another Interim Application being IA (Stamp) No. 11023 of 2021 on 21% May, 2021. The same came to be listed before us on 15\" June, 2021. By this Interim Application (‘IA’), Respondent No. 4 sought to raise this very issue which was already argued by it as a preliminary issue affecting the maintainability of the Writ Petition. By our Order dated 15\" June, 2021 we disposed of this IA by stating that the issue of grant of reliefs against a private entity such as Respondent No. 4 will be considered by us, as the same had been raised by Respondent No. 4. 18.6. In considering this submission or opposition to grant of interim reliefs against Respondent No. 4, it is to be noted that the final reliefs in the Writ Petition seek a Mandamus against Respondent Nos. 2 and 3 to exercise their statutory duties and take effective steps for the realisation of the amount due and payable to the Petitioner under the Recovery Certificate. It is not the case of any of the Respondents including Respondent No. 4 that the Writ Petition seeking such a Writ of Mandamus is not maintainable or is misconceived. The maintainability of the Writ Petition must be determined with reference to the final reliefs that are sought, and we have no doubt that such a Writ Petition would be maintainable under Article 226 of the Constitution of India. 18.7. It is well settled that grant of interim reliefs is in aid of final reliefs in any proceeding, such as a Writ Petition or a Suit. In the present case, the interim reliefs in terms of prayer clauses (b)(ii) and (b)(iii), which are directed against Respondent No. 4 (for deposit and injunction) and its assets, as also assets of its group entities, are clearly in aid of the final reliefs seeking action by the statutory authorities for realisation of the undisputed amounts under the Recovery Certificate. In the wide and extraordinary jurisdiction under Article 226 of the Constitution of India, there would be no embargo, or restriction on the grant of interim reliefs against an errant private party in aid of the final reliefs prayed for in the Writ Petition. The Court will of course have to be mindful, of the facts and circumstances in a given case, of whether a private law action is being substituted by exercise of a writ remedy. That is not the case here, since the Petitioner in the present case has already obtained an Order from the Adjudicating Officer constituted under the RERA Act for repayment of the amounts paid by the Petitioner with interest. That has, in turn, led to a Recovery Certificate. It is the failure to act in relation to that Recovery Certificate that has led to this Writ Petition and the interim reliefs sought for. If the interim reliefs as sought for by the Petitioner are not granted, it is extremely likely or possible that Respondent No. 4 and its group entities will deal with, or further encumber or mortgage their assets and there will be no prospect or possibility of realisation under the Recovery Certificate. The conduct of Respondent No. 4 and its Director as noted above, justifies such apprehension. 18.8. We see merit in the reliance placed by the Petitioner on the Judgment of the Allahabad High Court in Shri Ram Singh (supra) which in turn relies upon and reproduces the relevant extract from the Supreme Court decision in Dwarka Nath (supra). The relevant paragraphs of the Judgment are reproduced hereunder : “10. But as regards the second question as to whether the appellate or revisional order passed by a district court 1s amenable to a writ jurisdiction, the Full Bench in Ganga Saran's case has held as under. “With respect to the second question to be answered by us, we are not inclined to deal with it elaborately here. Suffice it to say that the view of the Supreme Court in Qamaruddin's case (supra) that ordinarily an interlocutory order passed in civil suit is not amenable to extraordinary jurisdiction of the High Court under Art. 226 of the Constitution, no doubt is based upon recognised principle taken into consideration by the court in refusing the writ. In our opinion, this view of the Supreme Court in Qamaruddin's case is based on assumption that a revision under S. 115, CPC to High Court is maintainable and the party aggrieved can invoke revisional jurisdiction of the High Court. But in a situation where a revision ts barred against the appellate or revisional order passed by the district courts and said order suffers from patent error of law and further causes manifest injustice to the party aggrieved can tt be said that such an order is not amenable to extraordinary jurisdiction of the High Court under Art. 226 of the Constitution. In our opinion, although everyinterlocutory order passed in civil suit is not subject to review under Art. 226 of the Constitution but if it is found from the order impugned that fundamental principle of law has been violated and further that such an order causes substantial injustice to the party aggrieved, the view taken by the Supreme Court in Qamaruddin's case (supra) will not preclude such a writ being issued by the High Court under Art. 226 of the Constitution. But only such writ petition under Art. 226 or 227 of the Constitution would be maintainable where writ can be issued within the ambit of the well-established and recognised principles laid down by the Supreme Court as well as by the various High Courts in that regard. The opinion expressed by the Supreme Court in Qamaruddin's case (supra) to the extent that a writ of mandamus cannot be issued to a private individual unless he is under statutory duty to perform a duty is in accord with well established principle regarding writ of certiorari and mandamus and need no reiteration or elaboration at our hand............ Where an aggrieved party approaches High Court under Art. 226 of the Constitution against an order passed in civil suit refusing to issue injunction to a private individual who is not under statutory duty to perform public duty or vacating an order of injunction, the main relief is for issue of a writ of mandamus to a private individual and such a writ petition under Art. 226 of the Constitution would not be maintainable. Following the decision of the Supreme Court in Qamaruddin's case (supra) this court cannot issue a writ of mandamus to a private party unless he is under a statutory duty to perform a public duty.” (Emphasis supplied) 11. From the above passage quoted from Ganga Saran's case (supra) it is evident that so far as maintainability of writ of certiorari against the impugned order is concerned, it is not in doubt. It ts also not in doubt that a writ of mandamus against the subordinate courts is maintainable. What is in doubt is whether a writ of mandamus against a private person can be issued if such private person is not under any statutory obligations to perform a public duty for the performance of which a writ of mandamus is normally issued. 12. In  ,  , the Supreme Court while considering the scope and ambit of powers of High Court under Art. 226 of the Constitution, has made the following observations (at page 84): “This Article is couched in comprehensive phraseology and it ex facie confers a wide power on the High Court to reach injustice wherever it is found. The Constitution designedly uses a wide language in describing the nature of power, the purpose for such and the person or authority against whom it can be exercised. It can issue writs in the nature of prerogative writs as understood in England but the scope of those writ petitions also is widened by the use of the expression ‘nature’ for the said expression does not equate the writ petition that can be issued in India with those in England but only draws an analogy from them. That apart, High Courts can also issue directions, orders or writs other than the prerogative writs. It enables the High Courts to mould the relief to meet peculiar and complicated requirements of the country, any attempt to equate the scope of the power of High Courts under Art. 226 of the Constitution with that of the English Courts to issue prerogative writs is to introduce an unnecessary procedural restrictions grown over the years in a comparatively small country like England with a unitary form of Government to a vast country like India functioning under a federal structure. Such construction defeats the purpose of Article itself.” 13. The above observations of the Supreme Court in Dwaritka Nath's case (supra) tend to support the view that a writ in the nature of mandamus may be issued against a private individual in view of the language of wide amplitude of Art. 226 is couched with. It is no doubt true that a writ jurisdiction under Art. 226 of the Constitution is in the nature of supervisory jurisdiction and not appellate one and that it is not a substitute for the ordinary remedies available under the normal law of the land and the High Court may under Art. 226 decline to interfere if an equally efficacious alternative remedy is available. The remedy for injunction ts available under the Civil P.C. and the Specific Relief Act 1963 but this is only a self imposed restriction. There ts no absolute bar. It is a question of discretion to be exercised on sound principles of law, justice and equity. Whether to grant or not to grant an ad interim injunction is certainly a matter involving the exercise of judgment and discretion of the subordinate Civil Courts and the High Court may not interfere in the matter but in its supervisory jurisdiction under Art. 226 of the Constitution, the High Court can certainly see whether the orders passed by the Subordinate courts suffer from any error of jurisdiction, patent illegality or perversity etc. and I am also of the opinion that the High Court while exercising its writ jurisdiction against an appellate or revisional order can issue a writ of certiorart/mandamus not only against the subordinate courts but it may also issue any order or direction, not necessarily in the nature of a writ, which it considers necessary to be issued in order to effectuate its certiorari jurisdiction. 14. Iam also of the opinion that the High Court while seized of a writ petition under Art. 226 of the Const. can also pass any order including an order in the nature of injunction against a private individual in exercise of tts inherent powers. In  , Vasco Digama, Goa  , his Lordship (R.M. Sahai, J.) of the Supreme Court in his concurring judgment has observed that “Art. 225 of the Constitution preserved jurisdiction including inherent jurisdiction which existed on the date the Constitution came into force and Art. 226 enlarged it by making it not only the custodian of fundamental rights of a citizen but as a repository power to reach its arms to do justice................ The High Courts in India being courts of unlimited jurisdiction, repository of all judicial power under the Constitution except what ts excluded, are competent to issue directions for arrest of foreign ship in exercise of statutory jurisdiction or even otherwise to effectuate the exercise of jurisdiction.” 15. Since the order impugned in this writ petition is amenable to certiorari jurisdiction of the High Court, it can safely be said, on the basis of the above quoted observations of the Supreme Court in M.V. Elisabeth case (supra), that while exercising certiorari jurisdiction, the High Courts may not only demolish the erroneous orders passed by subordinate courts and direct them to perform their judicial duties in accordance with law but it can also issue orders or directions which may be considered necessary to be passed in order to “effectuate” its certiorari/mandamus jurisdiction. Such a course is open not only on the strength of Art. 226 of the Constitution, but also on the dint of Art. 225 of the Constitution which makes the High Court a Court of record having inherent jurisdiction in exercise of which jurisdiction, the High Court can, in my opinion, issue an order or direction in the nature of an injunction even against a private individual. Decision of the Supreme Court in Qamaruddin's case and that of the Full Bench in Ganga Saran's case (supra) do not, in my judgment, create any hindrance in the way of the High Court passing an order in the nature of an injunction in exercise of tts inherent jurisdiction if it considers necessary to do so while disposing of the writ petition in order to effectuate its certiorari/mandamus jurisdiction against the subordinate courts or tribunals. The observations to the contrary in Qamaruddin's case (supra) Vere made in a different context and various aspects of High Court's power as examined in Dwaraka Nath's and Elisabeth's cases (supra) were not considered in Qamaruddin's case nor was the question examined from this angle in Ganga Saran's case.” 18.9. Our leaning towards granting interim reliefs is also supported by the dictum of the Supreme Court in the case of Deoraj (supra). We have noted that the Supreme Court has observed that in a given case, the failure to grant interim reliefs, even if they may be mandatory in nature, would defeat the ends of justice. It would be relevant to set out the said observations of the Supreme Court as under: “11. The Courts and tribunals seized of the proceedings within their jurisdiction take a reasonable time in disposing of the same. This ts on account of fair-procedure requirement which involves delay intervening between the previous and the next procedural steps leading towards preparation of case for hearing. Then, the courts are also overburdened and their hands are full. As the conclusion of hearing on merits is likely to take some time, the parties press Jor interim relief being granted in the interregnum. An order of interim relief may or may not be a reasoned one but the factors of prima facie case, irreparable injury and balance of convenience do work at the back of the mind of the one who passes an Order of interim nature. Ordinarily, the court is inclined to maintain status quo as obtaining on the date of the commencement of the proceedings. However, there are a few cases which call for the court’s leaning not in favour of maintaining the status quo and still lesser in percentage are the cases when an order tantamounting to a mandamus is required to be issued even at an interim stage. There are matters of significance and of moment posing themselves as moment of truth. Such cases do cause dilemma and put the wits of any judge to test. 12. Situations emerge where the granting of an interim relief would tantamount to granting the final relief itself: And then there may be converse cases where withholding of an interim relief would tantamount to dismissal of the main petition itself; for, by the time the main matter comes up for hearing there would be nothing left to be allowed as relief to the Petitioner though all the findings may be in his favour. In such cases the availability of a very strong prima facie case - of a standard much higher than just prima facie case, the considerations of balance of convenience and irreparable injury forcefully tilting the balance of the case totally in favour of the applicant may persuade the court to grant an interim relief though it amounts to granting final relief itself. Of course, such would be rare and exceptional cases. The court would grant such an interim relief only if satisfied that withholding of it would prick the conscience of the court and do violence to the sense of justice, resulting in ingustice being perpetuated throughout the hearing, and at the end the court would not be able to vindicate the cause of justice. Obviously such would be rare cases accompanied by compelling circumstances, where the injury complained of ts immediate and pressing and would cause extreme hardship. The conduct of the parties shall also have to be seen and the court may put the parties on such terms as may be prudent.” 18.10. Respondent No. 4 has in response, relied upon the Supreme Court Judgment in the case of VST Industries Lid. (supra) to contend that no reliefs can be granted against Respondent No. 4. This Judgment is of no assistance to Respondent No. 4 and has no application in the present case. VST Industries Lid. was a case where the final relief in a Writ Petition under Article 226 of the Constitution of India sought a writ of mandamus against the Appellant (Original Respondent) to treat the members of the respondent union (original petitioner), who are employees of the canteen of the appellant’s factory, as employees of the Appellant, and for grant of monetary and other consequential benefits. The Supreme Court observed that the appellant was a private entity involved in the business of manufacturing cigarettes and was a private party that was not discharging any public function or duty. In its discussion the Supreme Court also observed that a writ under Article 226 of the Constitution of India may lie against a private body in relation to discharge of a public duty. However, the Court stated that the obligation to maintain a canteen for welfare of its employees under Section 46 of the Factories Act, 1948, would not mean that the Appellant is discharging any public function so as to make it amenable to a writ of mandamus at the instance of the respondent labour union seeking absorption of its workers as employees of the Appellant. It is for these reasons that the Supreme Court held that the Single Judge and the Division Bench fell into error that the Appellant was amenable to writ jurisdiction. Interestingly, even after holding this, the Supreme Court did not interfere with the order of the High Court on merits. 18.11. The Judgment in VST Industries Lid., is wholly distinguishable and has no bearing on the issue that arises in the present Petition. In the present case, and as noted above, a Writ of Mandamus is sought against Respondent Nos. 2 and 3, who are statutory authorities and clearly amenable to the writ jurisdiction of this Court under Article 226 of the Constitution of India. We have already expressed our prima facie findings as to their failure to discharge statutory duties and responsibilities. This was clearly not the case in VST Industries Ltd., where the final relief of mandamus was sought only against a private entity that was held not to be discharging a public function or duty in relation to the subject matter of the dispute. Once we hold that the present Writ Petition is clearly maintainable and justified, it is certainly within the extraordinary and inherent jurisdiction of this Court under Article 226 of the Constitution of India to protect the rights and interests of the Petitioner by granting interim relief even against a private party Respondent that has wrongly benefitted from the inaction on the part of the public authorities in discharge of their public duty. In fact, this issue did not arise for consideration in the case of VST Industries Ltd. Thus, we hold that the Judgment of the Supreme Court in VST Industries Lid. extends no help / assistance to the Respondent No. 4. 18.12. Additionally, this submission of Respondent No. 4 to dismiss the Writ Petition against them, or to not grant interim reliefs against them, because they are a private entity is also contrary to the clear terms of the Order of the Supreme Court dated 12\" February, 2021, dismissing Respondent No. 4’s Special Leave Petition against this Courts Order dated 6™ March, 2020 and 14\" January, 2021. Both those Orders directed disclosure against Respondent No. 4 and its group companies. The Supreme Court not only dismissed the Special Leave Petitions but categorically went on to observe that, “we give our full imprimatur to the approach adopted by the High Court to ensure that in one manner or the other the petitioner honours decree which has been passed against him.” To refuse interim reliefs, for the reasons contended by Respondent No. 4, would be contrary to the very approach that has been approved by the Supreme Court. 18.13. Keeping in mind our above findings and the Order of the Supreme Court, we are of the view that a case has been made out for grant of interim reliefs, as prayed for against Respondent No. 4. From the Affidavits of Disclosure filed, it appears that Respondent No. 4 has 192 unsold units across its various projects being, Marvel Kyra (90 unsold units); Marvel Arco (2 unsold units); Marvel Bounty (18 unsold units); Marvel Sera (66 unsold units); Marvel Ribera (16 unsold units). This position may have changed as on date, but the status of unsold units of Respondent No. 4 can be readily ascertained from the RERA Website. 18.14. Accordingly, Respondent No. 4 is restrained by an order of injunction from selling, transferring, further encumbering, or alienating, or creating any further third-party rights in respect of its unsold units as on the date of uploading of this Order. The monies lying to the credit of the bank accounts in respect of these projects, or to the credit of the general bank accounts of Respondent No. 4, shall not be used except in the ordinary course of business. 18.15. As regards the prayer for injunction against the group companies, it is clear from the material placed before us that the Marvel Group has held itself out to be a single economic unit and that its projects are owned and operated or developed by various entities within the group. There has been no dispute that the various other entities that have been referred to in the Affidavits of Disclosure are indeed group entities of Respondent No. 4. This Court’s approach in seeking disclosure of even group companies’ assets has been approved by the Supreme Court. It is common for developers to set up different companies or special purpose vehicles to undertake projects as part of the development business of the group as a whole. 18.16. Prima facie we are of the view that recovery of monies under the Recovery Certificate, would in the facts and circumstances of the present case, also be permissible against the assets of group companies, especially if the non-payment of a clear undisputed amount is being illegally and dishonestly avoided, whilst at the same time very large sums of money are being raised and spent by the same group for carrying on large real estate development projects. To allow such persons to defeat and frustrate the recovery of monies by individual purchasers and at the same time, permit them to carry on their business as usual, would clearly undermine the rule of law and shake the confidence of the public at large. 18.17. From the disclosures made in the 3™ Disclosure Affidavits at Annexure 1, there are about 379 unsold units of the group companies/entities (other than Respondent No. 4) in different projects. The present position of unsold units for the projects undertaken by group companies will be as per the status on the RERA Website. In relation to the group companies that have been disclosed the order of injunction will operate only to the extent of those unsold units, if any, that are not encumbered or mortgaged. If those group companies intend to sell any of their unencumbered units they will have the liberty to apply to this Court, so that this Court may pass protective orders in respect of such sale proceeds. 18.18. Further, we direct Respondent No. 4 to deposit in this Court a sum of Rs. 11,36,33,625/- being the principal sum owed to the Petitioner, within four weeks from the date of uploading of this Order. If such deposit is made, the order of injunction as ordered above will stand vacated. The Petitioner would be at liberty to seek withdrawal of this amount in part satisfaction of the Recovery Certificate. As regards the Petitioner’s claim for interest at 10.05% (p.a.) of the amount stipulated in the Recovery Certificate, the same is effectively secured by the Tahsildar’s charge by its Letter dated 8\" February, 2021 on Respondent No. 4’s land for the sum of Rs. 6.5 crores. The Tahsildar will not vacate that charge without the leave of this Court. Further, the Tahsildar ought to take steps in relation to that land in accordance with law and if any amount is realised against such land, the same shall be paid to the Petitioner in part satisfaction of the Recovery Certificate. 18.20. The application for interim reliefs is accordingly allowed in the aforesaid terms. Parties shall be at liberty to apply. Costs will be considered at the stage of final disposal of the Writ Petition. 19. After this judgment was reserved, it was brought to our notice that Respondent No.4’s Special Leave Petition against the Order and Judgment dated 9\" March, 2021, has been dismissed by the Supreme Court on 14\" July, 2021. This is noted for completeness."}
]