[
    {
        "title": "CHOURANGI BUILDERS AND DEVELOPERS PVT. LTD. v. HANSA KISHORE SHAH AND OTHERS",
        "date": "",
        "summary": "SAST921462020 remanded For the Appellant in SAST921582020 and SAST921862020 and For the Respondent No.3 in SAST92146 of 2020. Mr. Mayur Khandeparkar aw Mr. Ranjeev Carvalho, Mr. Vikramjit Garewal, Ms. Sabeena Mahadik, Mr. Pankaj Uttaradhi and Mr. Aayush Kothari For the Respondent No.3 in SAST92158 and SAST921862020 and For the Appellant in SAST9214..."
    },
    {
        "title": "Rustam Phiroze Mehta v. State Of Maharashtra",
        "date": "",
        "summary": "WRIT PETITION (ST) NO. 3221 OF 2020 HONBLE SHRI JUSTICE S.J. KATHAWALLA, HONBLE SHRI JUSTICE MILIND N. JADHAV Order 21 Rule 32 of CPC. Rules 8, 10, 22 and 24 Section 14(1) of the Contempt Act read with Rule 4 Section 263 and Section 267 read with Rule 17 of the Maharashtra Realisation of Land Revenue Rules, 1967, Section 2(b) of the Contempt of Cou..."
    },
    {
        "title": "VIPUL JASWANTLAL SANGHAVI v. MACROTECH DEVELOPERS LIMITED (EARLIER KNOWN AS LODHA DEVELOPERS LTD.)",
        "date": null,
        "summary": "C.A. No.004408004408  2023 UDAYADITYA BANERJEE ITEM NO.802 COURT NO.14 SECTION IX S U P R E M E C O U R T O F I N D I A RECORD OF PROCEEDINGS SPECIAL LEAVE PETITION (CIVIL) Diary No(s). 118012021 SECTION IX S U P R E M E C O U R T O F I N D I A RECORD OF PROCEEDINGS SPECIAL LEAVE PETITION (CIVIL) Diary No(s). 118012021 (Arising out of impugned fina..."
    },
    {
        "title": "RAMESH SWAMINATH SINGH v. THE SLUM REHABILITATION AUTHORITY AND 6 ORS",
        "date": null,
        "summary": "WP10602024 NA HONBLE SHRI JUSTICE M.S. SONAK HONBLE JUSTICE KAMAL KHATA Section 3C Section 14 of the Slum Act. Slum Act or of Article 300A of the Constitution of India Sections 14 and 17 of the Slum Act Section 3(C) or Section 14 of the Slum Act Section 3C(1) of the Maharashtra Slum Areas (Improvements, Clearance and Page 7 of 34 Redevelopment) Act..."
    },
    {
        "title": "MOHAMMED ZAIN KHAN v. EMNOY PROPERTIES IND...",
        "date": null,
        "summary": "SA2092022 in part HONBLE SHRI JUSTICE SANDEEP V. MARNE provisions of this Act or the Rules and Regulations Development) Act, 2016 (the RERA) provisions of section 3 of the RERA. Section 59 provisions of the RERA. 17. Section 3 26 of 32 26 section 59 sections 12, 18, 59 read with sections 31 sub section 2. Section 4 31 of 32 31 provisions of Section..."
    },
    {
        "title": "NEELKAMAL REALTORS SUBURBAN PVT. LTD. & 4 ORS. v. SOURABH GUPTA",
        "date": null,
        "summary": "FA1762023 in part MR. MOHIT P. BHANSALI us 5 of Limitation Act, 1. The Complainants filed an Appeal seeking enhancement and ancillary reliefs against the State Consumer Disputes Redressal Commission, Maharashtras decision partially allowing their claims for deficiency in service by the Builders. 2. The Builders filed a separate set of Appeals, albe..."
    },
    {
        "title": "PRADIP GIRISHKANT MEHTA & ANR. v. NEELKAMAL REALTORS SUBURBAN PVT. LTD. & 6 ORS.",
        "date": null,
        "summary": "FA2692022 in part  us 5 of Limitation Act, (Against the Order dated 09022022 in Complaint No. 8262016 of the State Commission Maharashtra) 1. PRADIP GIRISHKANT MEHTA  ANR. A15, 4TH FLOOR, PARASMANI CHSL, OPP. JOGGERS PARK, CHICKUWADI OFF. LINK ROAD, BORAVALI W, MUMBAI92 2. MRS. BHARATI PRADIP MEHTA FLAT NO. A15, 4TH FLOOR, PARASMANI CHSL, OPP. JOGG..."
    },
    {
        "title": "RARE TOWNSHIPS PVT. LTD. v. JATIN MAVANI",
        "date": null,
        "summary": "SAST285462019 remanded HONBLE SHRI JUSTICE P. K. CHAVAN A Single Member of RERA Tribunal, by the impugned order dated 25th September, 2019 condoned a delay of two days by a reasoned order. Whether the order passed by the administrative member sitting single is without jurisdiction It is held that the order passed by the administrative member sittin..."
    },
    {
        "title": "LAVASA CORPORATION LTD. HICON HOUSE. v. GIRISH VASSAN PANJWANI AND OTHERS",
        "date": null,
        "summary": "SAST184672018 allowed JUSTICE DR. SHALINI PHANSALKARJOSHI provisions of this Act. 42 69. Section 115 of the Indian Evidence Act, 1872. Clause (c) of subsection (2) of Section 3 Act. Subclause (2) of Section 3 Development) Act, 2016, sub section (1) of Section 71. Section 115 of the 7 Evidence Act Maharashtra Ownership Flats (Regulation of the Promo..."
    },
    {
        "title": "LAVASA CORPORATION LTD. HICON HOUSE. v. MANJU NARENDRA JOSHI OF MUMBAI INDIAN INHABITANT",
        "date": null,
        "summary": "CAS7912018 allowed HONBLE SMT. JUSTICE DR. SHALINI PHANSALKARJOSHI provisions of this Act. 42 69. Section 115 of the Indian Evidence Act, 1872. Clause (c) of subsection (2) of Section 3 Act. Subclause (2) of Section 3 Development) Act, 2016, sub section (1) of Section 71. Section 115 of the 7 Evidence Act Maharashtra Ownership Flats (Regulation of ..."
    },
    {
        "title": "RAGINI KAMAL CHOKSHI v. STATE OFMAHARASHTRA AND 5 ORS",
        "date": null,
        "summary": "WPL286992021 dismissed HONBLE SHRI JUSTICE S.J. KATHAWALLAHONBLE SHRI JUSTICE MILIND N. JADHAV Section 2(d) of the Real Estate (Regulation and Development) Act, 2016 (the said Act) Kanchan P Dhuri 1  35 WP4442022.odt ORDINARY ORIGINAL CIVIL JURISDICTION WRIT PETITION NO. 444 OF 2022 WITH INTERIM APPLICATION NO.3307 OF 2021 INTERIM APPLICATION NO.33..."
    },
    {
        "title": "BIKRAM CHATTERJI v. UNION OF INDIA",
        "date": null,
        "summary": "W.P.(C) No.000940  2017 HIMANSHU SHEKHAR CYRIL AMARCHAND MANGALDAS AOR us 174 of Companies Act, 2013. The case involves complex financial transactions, allegations of money laundering, and nonpayment of dues. The court is likely to order the recovery of outstanding amounts, investigate financial irregularities, and hold individuals accountable for ..."
    },
    {
        "title": "BIKRAM CHATTERJI v. UNION OF INDIA",
        "date": null,
        "summary": "W.P.(C) No.000940  2017 HIMANSHU SHEKHAR CYRIL AMARCHAND MANGALDAS AOR us 174 of Companies Act, 2013. The case involves complex financial transactions, allegations of money laundering, and nonpayment of dues. The court is likely to order the recovery of outstanding amounts, investigate financial irregularities, and hold individuals accountable for ..."
    }
]